index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2026-07-08 mié 11:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Apuntes IA Verano</title>
<meta name="author" content="Eduardo Alcaraz" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/minimal-sobrio.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Apuntes IA Verano</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgad70819">Tutorial — Entornos virtuales en Python (Windows, Linux, macOS)</a>
<ul>
<li><a href="#org91da56d">Conceptos básicos</a>
<ul>
<li><a href="#org95cf701">¿Qué es un entorno virtual?</a></li>
<li><a href="#org1ad4d87">Entorno virtual ≠ versión de Python</a></li>
<li><a href="#orgca7b8f6">Herramientas que verás en este tutorial</a></li>
</ul>
</li>
<li><a href="#org77fde86">Paso 0 — Ver qué Python tienes instalado</a>
<ul>
<li><a href="#orgaa941af">Linux y macOS (terminal)</a></li>
<li><a href="#orge616016">Windows (PowerShell o CMD)</a></li>
<li><a href="#orga7d4a84">Tabla rápida por sistema</a></li>
</ul>
</li>
<li><a href="#org6c5b467">Método 1 — <code>venv</code> (incluido en Python, el más estándar)</a>
<ul>
<li><a href="#org35ac8db">Crear entorno con una versión específica</a></li>
<li><a href="#orgec0aea3">Activar el entorno</a></li>
<li><a href="#org67d42dc">Comprobar que usas el Python correcto</a></li>
<li><a href="#orge83e696">Instalar paquetes y guardar dependencias</a></li>
<li><a href="#orgc1894e9">Borrar un entorno</a></li>
</ul>
</li>
<li><a href="#org4b86f82">Método 2 — <b>pyenv</b> (varias versiones de Python en una máquina)</a>
<ul>
<li><a href="#org2a9cc31">¿Cuándo usar pyenv?</a></li>
<li><a href="#orgfdd3ee9">Instalación</a></li>
<li><a href="#org6f8473d">Instalar versiones de Python con pyenv</a></li>
<li><a href="#orge54133d">Elegir versión global o por carpeta</a></li>
<li><a href="#org9ff7cfe">Entorno virtual con pyenv</a></li>
</ul>
</li>
<li><a href="#orgd49c492">Método 3 — <code>virtualenv</code> (paquete pip)</a></li>
<li><a href="#org5821822">Método 4 — Conda / Miniconda (opcional, ciencia de datos)</a>
<ul>
<li><a href="#orgcd895c8">Idea</a></li>
<li><a href="#org7e43bc6">Conda vs venv</a></li>
</ul>
</li>
<li><a href="#org550510d">Flujo de trabajo recomendado por escenario</a>
<ul>
<li><a href="#orgcf7c380">Escenario A — Un solo proyecto, una versión fija (curso)</a></li>
<li><a href="#orgcbdcfb7">Escenario B — Tres proyectos, tres versiones</a></li>
<li><a href="#org5c5b53d">Escenario C — Windows con lanzador py</a></li>
</ul>
</li>
<li><a href="#orgb1b7baf">Buenas prácticas</a></li>
<li><a href="#org92c7766">.gitignore mínimo</a></li>
<li><a href="#orga22795e">Problemas frecuentes y soluciones</a></li>
<li><a href="#org35ca76a">Cheat sheet</a>
<ul>
<li><a href="#org070ae42">Linux / macOS</a></li>
<li><a href="#orgdb1df7f">Windows</a></li>
</ul>
</li>
<li><a href="#org3920d27">Referencias</a></li>
</ul>
</li>
<li><a href="#org78417fa">Introducción a la Inteligencia Artificial</a>
<ul>
<li><a href="#org15950e7">1.1 Introducción a la Inteligencia Artificial</a>
<ul>
<li><a href="#orge713d5f">¿Qué es la Inteligencia Artificial?</a></li>
<li><a href="#org666fb99">Problemas típicos de la IA</a></li>
<li><a href="#org03c86f6">IA débil vs IA fuerte (distinción conceptual)</a></li>
<li><a href="#org41e6a26">Relación con otras disciplinas</a></li>
<li><a href="#org47792dd">Idea clave del curso</a></li>
</ul>
</li>
<li><a href="#orga07e4e1">1.2 Historia de la Inteligencia Artificial</a>
<ul>
<li><a href="#orgad01b66">Orígenes (décadas de 1940–1950)</a></li>
<li><a href="#orgd41a117">Era del optimismo (1956–1974)</a></li>
<li><a href="#orgb4f85d8">Primer “invierno” de la IA (1974–1980)</a></li>
<li><a href="#org1b736d8">Sistemas expertos y boom comercial (1980–1987)</a></li>
<li><a href="#orge9bb24d">Segundo invierno (1987–1993)</a></li>
<li><a href="#orgf4352b6">Resurgimiento: aprendizaje automático y datos (1990–2010)</a></li>
<li><a href="#org4ef867a">Era del <b>deep learning</b> (2010–presente)</a></li>
<li><a href="#org5adce46">Línea de tiempo resumida</a></li>
</ul>
</li>
<li><a href="#org1f24d0d">1.3 Habilidades cognoscitivas y teorías de la inteligencia</a>
<ul>
<li><a href="#org72b3768">Habilidades cognoscitivas (psicología)</a></li>
<li><a href="#org0f9de86">Teoría conductista (conductismo)</a></li>
<li><a href="#org3b326e8">Teoría de la inteligencia general (factor <b>g</b>)</a></li>
<li><a href="#org2f0ee91">Inteligencias múltiples (Howard Gardner)</a></li>
<li><a href="#orgfde6ca3">Otras teorías (mención)</a></li>
</ul>
</li>
<li><a href="#orgd3021c4">1.4 Razonamiento según la lógica</a>
<ul>
<li><a href="#org593b839">Lógica como fundamento del razonamiento automático</a></li>
<li><a href="#orgf5c82df">Componentes básicos</a></li>
<li><a href="#orgdb1e915">Ejemplo mínimo (lógica proposicional)</a></li>
<li><a href="#orgb7b7b2c">Sistemas formales relevantes en IA</a></li>
<li><a href="#org030ea67">Límites importantes</a></li>
</ul>
</li>
<li><a href="#org32cec4d">1.5 Adquisición del conocimiento según la filosofía</a>
<ul>
<li><a href="#org7ee6d35">¿Qué es el conocimiento? (epistemología)</a></li>
<li><a href="#orgb3d33b4">Empirismo vs racionalismo</a></li>
<li><a href="#orgfc7928c">Fuentes de conocimiento en sistemas inteligentes</a></li>
<li><a href="#orgabe6efe">Problema de la adquisición de conocimiento (<b>knowledge acquisition bottleneck</b>)</a></li>
<li><a href="#org3d4514e">Representación del conocimiento (puente filosofía → IA)</a></li>
</ul>
</li>
<li><a href="#org06cac20">1.6 El modelo cognoscitivo</a>
<ul>
<li><a href="#orgae617b5">Definición</a></li>
<li><a href="#orgf819a7c">Arquitecturas cognitivas clásicas</a></li>
<li><a href="#org785198a">Componentes típicos de un modelo cognoscitivo</a></li>
<li><a href="#orgfae425b">Modelo cognoscitivo vs modelo de agente</a></li>
<li><a href="#org164dd7f">Conexión con IA moderna</a></li>
</ul>
</li>
<li><a href="#orgc8ede65">1.7 Modelo del agente inteligente</a>
<ul>
<li><a href="#org3c0353d">Definición de agente</a></li>
<li><a href="#org4cf9ce4">Función agente</a></li>
<li><a href="#org639386b">Componentes de un agente racional</a></li>
<li><a href="#orgc28775c">Tipos de agentes (Jersey / Russell &amp; Norvig)</a></li>
<li><a href="#orgd7e88c8">PEAS (ejemplo: taxi autónomo)</a></li>
<li><a href="#orga171320">Propiedades del entorno (para elegir técnica)</a></li>
<li><a href="#org88e292e">Sistemas multiagente (SMA)</a></li>
<li><a href="#org60669cd">Sistemas ubicuos (<b>ubicomp</b>)</a></li>
</ul>
</li>
<li><a href="#orgdcb80e7">1.8 El papel de la heurística</a>
<ul>
<li><a href="#org2f18260">¿Qué es una heurística?</a></li>
<li><a href="#org3bde0e2">Propiedades deseables</a></li>
<li><a href="#org505e359">Búsqueda ciega vs informada vs local</a></li>
</ul>
</li>
<li><a href="#org803dfe6">1.8.1 Algoritmos de exploración de alternativas</a>
<ul>
<li><a href="#orga65be8d">Modelo de problema de búsqueda</a></li>
<li><a href="#orgac52f96">Búsqueda en anchura (BFS)</a></li>
<li><a href="#org0ef00d2">Búsqueda en profundidad (DFS)</a></li>
<li><a href="#org1f39c65">Costo uniforme (UCS / Dijkstra en grafo de estados)</a></li>
<li><a href="#org4e2ff68">Greedy best-first</a></li>
<li><a href="#org03cfb1a">Ejemplo: laberinto en Python (BFS)</a></li>
</ul>
</li>
<li><a href="#org8abc390">1.8.2 Algoritmo A*</a>
<ul>
<li><a href="#org025bd35">Idea</a></li>
<li><a href="#org1af3e29">Pseudocódigo (conceptual)</a></li>
<li><a href="#org1e7aa96">Condiciones para optimalidad</a></li>
<li><a href="#orgd436111">Ejemplo: A* en cuadrícula (Manhattan)</a></li>
<li><a href="#org30d3be0">Cuándo usar A*</a></li>
</ul>
</li>
<li><a href="#orga7fb474">1.8.3 Algoritmos de búsqueda local</a>
<ul>
<li><a href="#org2723481">Idea</a></li>
<li><a href="#org976d029">Hill climbing (escalada de colina)</a></li>
<li><a href="#org41c7687">Variantes</a></li>
<li><a href="#org486f19c">Ejemplo: hill climbing (maximizar función 1D discreta)</a></li>
<li><a href="#org533139f">Búsqueda local vs A*</a></li>
</ul>
</li>
<li><a href="#org96d6f5c">Síntesis del temario</a></li>
<li><a href="#org8f8ef16">Referencias sugeridas</a></li>
<li><a href="#orgc7fffc6">Preguntas de repaso</a></li>
</ul>
</li>
<li><a href="#org787b17f">Acertijos de IA: espacio de estados, lógica y poda</a>
<ul>
<li><a href="#org623dc44">1. El problema de los maridos celosos</a>
<ul>
<li><a href="#orgbb7534c">Enunciado</a></li>
<li><a href="#orgcd191f2">Modelado del espacio de estados (sin enumerar todo a ciegas)</a></li>
<li><a href="#orgba5a81c">Razonamiento guiado (lógica antes que fuerza bruta)</a></li>
<li><a href="#org5255b9e">Solución óptima: <b>9 viajes</b></a></li>
</ul>
</li>
<li><a href="#org3b02efd">2. El puente y la linterna (optimización en 17 minutos)</a>
<ul>
<li><a href="#org17afd6f">Enunciado</a></li>
<li><a href="#org8985ff5">Modelado (estado acotado)</a></li>
<li><a href="#org106bccd">Razonamiento lógico (sin BFS)</a></li>
<li><a href="#org7b8f757">Solución paso a paso</a></li>
</ul>
</li>
<li><a href="#orged7471a">3. Flavio Josefo y el círculo de la muerte</a>
<ul>
<li><a href="#orgdc38775">Historia</a></li>
<li><a href="#orga9e4c77">Enunciado matemático</a></li>
<li><a href="#org5245d78">¿Por qué no expandir el árbol completo?</a></li>
<li><a href="#org9ae4cae">Caso k = 2 (eliminar cada segundo)</a></li>
<li><a href="#org5c7f275">Ejemplo manual: n = 7, k = 2</a></li>
<li><a href="#org7d938cb">Caso general k (algoritmo iterativo O(n))</a></li>
<li><a href="#org39314a1">Síntesis: lógica vs explosión combinatoria</a></li>
<li><a href="#org5a6b81f">Preguntas de repaso</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga08467f">A*  — Arriero, coyote, cabra y maíz</a>
<ul>
<li><a href="#org397c25b">Símbolos</a></li>
<li><a href="#org47b424e">Reglas del bote</a></li>
<li><a href="#org277ad02">Objetivo</a></li>
<li><a href="#org7575966">Parte 1 — ¿Qué es un estado? (la “fotografía” del río)</a></li>
<li><a href="#org6ff8c73">Parte 2 — El espacio de estados (el mapa completo del camino bueno)</a>
<ul>
<li><a href="#orgf4b2533">Los 8 estados del camino más corto (7 cruces)</a></li>
<li><a href="#orgfd03d95">Dibujo del camino (solo flechas hacia adelante)</a></li>
<li><a href="#org887da31">¿Por qué no hay más estados en el camino bueno?</a></li>
<li><a href="#orgb286a87">Ramas que se cortan desde E0 (ejemplo de poda)</a></li>
</ul>
</li>
<li><a href="#org4fca604">Parte 3 — g, h y f</a>
<ul>
<li><a href="#org0015303">g = “¿Cuántos cruces ya hice?”</a></li>
<li><a href="#orgac1af8b">h = “¿Cuántos cruces <b>creo</b> que faltan?” (estimación)</a></li>
<li><a href="#org3e49b27">f = “¿Qué tan prioritario es este estado?”</a></li>
</ul>
</li>
<li><a href="#orgd5a3a49">Parte 4 — A* paso a paso (tabla de “lista de pendientes”)</a>
<ul>
<li><a href="#org83752c9">Iteración 1</a></li>
<li><a href="#org99c5ea6">Iteración 2</a></li>
<li><a href="#org00feb9a">Iteración 3</a></li>
<li><a href="#orgcb9a1d3">Iteración 4</a></li>
<li><a href="#org56552bb">Iteraciones 5–7 (resumen en una tabla)</a></li>
<li><a href="#orgefbe7b9">¿Qué aprendiste del proceso?</a></li>
</ul>
</li>
<li><a href="#orga6a7315">Parte 5 — La solución contada como cuento (7 cruces)</a></li>
<li><a href="#org1fd15bd">Parte 6 — Comparación rápida</a></li>
<li><a href="#org46b0bba">Parte 7 — Ejercicios con lápiz y papel</a></li>
</ul>
</li>
<li><a href="#org42505cd">Actividades</a>
<ul>
<li><a href="#org494999e">Operación Dino Crash (EDA conceptual)</a>
<ul>
<li><a href="#org5efc777">Introducción a la Misión</a></li>
<li><a href="#org4485cca">¿Qué es EDA y por qué va <b>antes</b> del modelo?</a></li>
<li><a href="#orgbdd2d80">Bloque 1 — ¿Qué dataset necesitamos?</a></li>
<li><a href="#orgf23db4b">Bloque 2 — Preguntas que todo EDA debe responder</a></li>
<li><a href="#orgdc012ab">Bloque 3 — Del EDA a la elección del modelo</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgad70819" class="outline-2">
<h2 id="orgad70819">Tutorial — Entornos virtuales en Python (Windows, Linux, macOS)</h2>
<div class="outline-text-2" id="text-orgad70819">
<p>
Aprender a crear y usar <b>entornos virtuales</b> en Python cuando tienes <b>varias versiones</b> de Python instaladas (3.9, 3.10, 3.11, 3.12, 3.13…) en:
</p>

<ul class="org-ul">
<li><b>Windows</b></li>
<li><b>Linux</b> (Debian/Ubuntu, Fedora, Arch…)</li>
<li><b>macOS</b> (Intel y Apple Silicon)</li>
</ul>

<p>
Al terminar sabrás:
</p>

<ol class="org-ol">
<li>Qué es un entorno virtual y por qué no instalar todo con <code>pip</code> global.</li>
<li>Cómo ver qué versiones de Python tienes en cada sistema.</li>
<li>Cómo crear un <code>venv</code> con una versión <b>concreta</b>.</li>
<li>Cómo gestionar muchas versiones con <b>pyenv</b> (recomendado).</li>
<li>Cómo activar, desactivar, exportar dependencias y borrar entornos.</li>
<li>Cómo resolver errores típicos.</li>
</ol>
</div>
<div id="outline-container-org91da56d" class="outline-3">
<h3 id="org91da56d">Conceptos básicos</h3>
<div class="outline-text-3" id="text-org91da56d">
</div>
<div id="outline-container-org95cf701" class="outline-4">
<h4 id="org95cf701">¿Qué es un entorno virtual?</h4>
<div class="outline-text-4" id="text-org95cf701">
<p>
Un <b>entorno virtual</b> es una carpeta aislada que contiene:
</p>

<ul class="org-ul">
<li>Un intérprete de Python (o un enlace a uno concreto).</li>
<li>Su propio <code>pip</code>.</li>
<li>Sus propios paquetes en <code>site-packages</code>.</li>
</ul>

<p>
Cada proyecto puede tener versiones distintas de Django, NumPy, etc., sin pelearse.
</p>
</div>
</div>
