introduccion_inteligencia_artificial.org
*** Entorno virtual ≠ versión de Python
| Idea | Qué es |
|------+--------|
| *Versión de Python* | 3.10, 3.12… el lenguaje en sí |
| *Entorno virtual* | Carpeta aislada de paquetes *para un proyecto* |

Puedes tener Python 3.12 instalado y crear tres entornos 3.12 con librerías diferentes.

*** Herramientas que verás en este tutorial
| Herramienta | Viene con Python | Varias versiones de Python | Uso típico |
|-------------+------------------+----------------------------+------------|
| =venv= | Sí (3.3+) | Solo si ya tienes ese binario | Proyectos simples, estándar |
| =virtualenv= | No (=pip install=) | Igual que =venv= | Compatibilidad extra |
| *pyenv* | No | *Sí*, instala y cambia versiones | Desarrollo con 3.9–3.13 |
| *conda* / Miniconda | No | Sí (canales propios) | Ciencia de datos, CUDA |
| *uv* | No | Sí, muy rápido | Proyectos modernos (mención) |

*Recomendación general:*
- *Principiante / curso:* =python3.12 -m venv .venv= (o la versión que pida tu materia).
- *Varias versiones en la misma máquina:* *pyenv* + =pyenv virtualenv=.

** Paso 0 — Ver qué Python tienes instalado

*** Linux y macOS (terminal)

#+begin_src shell :exports code
# Versiones en PATH
python3 --version
python3.12 --version 2>/dev/null
python3.11 --version 2>/dev/null

# Dónde está cada binario
which python3
which python3.12 2>/dev/null

# Todas las que encuentre el sistema (Debian/Ubuntu)
ls -la /usr/bin/python3* 2>/dev/null
#+end_src

*** Windows (PowerShell o CMD)

#+begin_src powershell :exports code
python --version
py --version
py -0p
#+end_src

El lanzador =py= en Windows lista versiones instaladas. Ejemplo de salida:

#+begin_example
 -V:3.12 *        C:\Users\tu\AppData\Local\Programs\Python\Python312\python.exe
 -V:3.11          C:\Users\tu\AppData\Local\Programs\Python\Python311\python.exe
#+end_example

*** Tabla rápida por sistema

| Sistema | Comando habitual | Varias versiones |
|---------+------------------+------------------|
| Linux | =python3.12=, =python3.11= | Paquetes del sistema o pyenv |
| macOS | =python3= (Homebrew) | =brew install python@3.12= o pyenv |
| Windows | =py -3.12= | Instaladores python.org o pyenv-win |

** Método 1 — =venv= (incluido en Python, el más estándar)

*** Crear entorno con una versión específica

La regla de oro:

#+begin_example
<python-DESEADA> -m venv <carpeta-del-entorno>
#+end_example

**** Linux

#+begin_src shell :exports code
cd ~/proyectos/mi_app
python3.12 -m venv .venv
# o con ruta explícita si hay varias:
/usr/bin/python3.11 -m venv .venv311
#+end_src

**** macOS

#+begin_src shell :exports code
cd ~/proyectos/mi_app
python3.12 -m venv .venv
# Si usas Homebrew y el binario tiene otro nombre:
/opt/homebrew/bin/python3.12 -m venv .venv
#+end_src

**** Windows (PowerShell)

#+begin_src powershell :exports code
cd $HOME\proyectos\mi_app
py -3.12 -m venv .venv
# o ruta completa:
# C:\Users\tu\AppData\Local\Programs\Python\Python312\python.exe -m venv .venv
#+end_src

*** Activar el entorno

| Sistema | Comando activar | Desactivar |
|---------+-----------------+------------|
| Linux / macOS | =source .venv/bin/activate= | =deactivate= |
| Windows CMD | =.venv\Scripts\activate.bat= | =deactivate= |
| Windows PowerShell | =.venv\Scripts\Activate.ps1= | =deactivate= |

*PowerShell* puede bloquear scripts. Si falla:

#+begin_src powershell :exports code
Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser
#+end_src

*** Comprobar que usas el Python correcto

Tras activar:

#+begin_src shell :exports code
which python
python --version
pip --version
#+end_src

En Windows:

#+begin_src powershell :exports code
Get-Command python
python --version
pip --version
#+end_src

Debe apuntar a =.venv= (Linux/Mac) o =.venv\Scripts\python.exe= (Windows).

*** Instalar paquetes y guardar dependencias

#+begin_src shell :exports code
pip install --upgrade pip
pip install requests pandas
pip freeze > requirements.txt
#+end_src

En otra máquina o compañero:

#+begin_src shell :exports code
python3.12 -m venv .venv
source .venv/bin/activate
pip install -r requirements.txt
#+end_src

*** Borrar un entorno
Solo elimina la carpeta (con el entorno *desactivado*):

#+begin_src shell :exports code
deactivate
rm -rf .venv
#+end_src

Windows: =Remove-Item -Recurse -Force .venv=

** Método 2 — *pyenv* (varias versiones de Python en una máquina)

*** ¿Cuándo usar pyenv?
- Necesitas 3.10 para un proyecto viejo y 3.12 para uno nuevo.
- No quieres mezclar el Python del sistema (Linux/macOS) con tus proyectos.
- Quieres un comando global: =pyenv local 3.11.9= en una carpeta.

*** Instalación

