index.html
<div id="outline-container-org1ad4d87" class="outline-4">
<h4 id="org1ad4d87">Entorno virtual ≠ versión de Python</h4>
<div class="outline-text-4" id="text-org1ad4d87">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Idea</th>
<th scope="col" class="org-left">Qué es</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Versión de Python</b></td>
<td class="org-left">3.10, 3.12… el lenguaje en sí</td>
</tr>

<tr>
<td class="org-left"><b>Entorno virtual</b></td>
<td class="org-left">Carpeta aislada de paquetes <b>para un proyecto</b></td>
</tr>
</tbody>
</table>

<p>
Puedes tener Python 3.12 instalado y crear tres entornos 3.12 con librerías diferentes.
</p>
</div>
</div>
<div id="outline-container-orgca7b8f6" class="outline-4">
<h4 id="orgca7b8f6">Herramientas que verás en este tutorial</h4>
<div class="outline-text-4" id="text-orgca7b8f6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Herramienta</th>
<th scope="col" class="org-left">Viene con Python</th>
<th scope="col" class="org-left">Varias versiones de Python</th>
<th scope="col" class="org-left">Uso típico</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>venv</code></td>
<td class="org-left">Sí (3.3+)</td>
<td class="org-left">Solo si ya tienes ese binario</td>
<td class="org-left">Proyectos simples, estándar</td>
</tr>

<tr>
<td class="org-left"><code>virtualenv</code></td>
<td class="org-left">No (<code>pip install</code>)</td>
<td class="org-left">Igual que <code>venv</code></td>
<td class="org-left">Compatibilidad extra</td>
</tr>

<tr>
<td class="org-left"><b>pyenv</b></td>
<td class="org-left">No</td>
<td class="org-left"><b>Sí</b>, instala y cambia versiones</td>
<td class="org-left">Desarrollo con 3.9–3.13</td>
</tr>

<tr>
<td class="org-left"><b>conda</b> / Miniconda</td>
<td class="org-left">No</td>
<td class="org-left">Sí (canales propios)</td>
<td class="org-left">Ciencia de datos, CUDA</td>
</tr>

<tr>
<td class="org-left"><b>uv</b></td>
<td class="org-left">No</td>
<td class="org-left">Sí, muy rápido</td>
<td class="org-left">Proyectos modernos (mención)</td>
</tr>
</tbody>
</table>

<p>
<b>Recomendación general:</b>
</p>
<ul class="org-ul">
<li><b>Principiante / curso:</b> <code>python3.12 -m venv .venv</code> (o la versión que pida tu materia).</li>
<li><b>Varias versiones en la misma máquina:</b> <b>pyenv</b> + <code>pyenv virtualenv</code>.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org77fde86" class="outline-3">
<h3 id="org77fde86">Paso 0 — Ver qué Python tienes instalado</h3>
<div class="outline-text-3" id="text-org77fde86">
</div>
<div id="outline-container-orgaa941af" class="outline-4">
<h4 id="orgaa941af">Linux y macOS (terminal)</h4>
<div class="outline-text-4" id="text-orgaa941af">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #928374;"># </span><span style="color: #928374;">Versiones en PATH
</span>python3 --version
python3.12 --version 2&gt;/dev/null
python3.11 --version 2&gt;/dev/null

<span style="color: #928374;"># </span><span style="color: #928374;">D&#243;nde est&#225; cada binario
</span><span style="color: #fe8019;">which</span> python3
<span style="color: #fe8019;">which</span> python3.12 2&gt;/dev/null

<span style="color: #928374;"># </span><span style="color: #928374;">Todas las que encuentre el sistema (Debian/Ubuntu)
</span>ls -la /usr/bin/python3* 2&gt;/dev/null
</pre>
</div>
</div>
</div>
<div id="outline-container-orge616016" class="outline-4">
<h4 id="orge616016">Windows (PowerShell o CMD)</h4>
<div class="outline-text-4" id="text-orge616016">
<div class="org-src-container">
<pre class="src src-powershell">python --version
py --version
py -0p
</pre>
</div>

<p>
El lanzador <code>py</code> en Windows lista versiones instaladas. Ejemplo de salida:
</p>

<pre class="example" id="org914d819">
 -V:3.12 *        C:\Users\tu\AppData\Local\Programs\Python\Python312\python.exe
 -V:3.11          C:\Users\tu\AppData\Local\Programs\Python\Python311\python.exe
</pre>
</div>
</div>
<div id="outline-container-orga7d4a84" class="outline-4">
<h4 id="orga7d4a84">Tabla rápida por sistema</h4>
<div class="outline-text-4" id="text-orga7d4a84">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sistema</th>
<th scope="col" class="org-left">Comando habitual</th>
<th scope="col" class="org-left">Varias versiones</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Linux</td>
<td class="org-left"><code>python3.12</code>, <code>python3.11</code></td>
<td class="org-left">Paquetes del sistema o pyenv</td>
</tr>

<tr>
<td class="org-left">macOS</td>
<td class="org-left"><code>python3</code> (Homebrew)</td>
<td class="org-left"><code>brew install python@3.12</code> o pyenv</td>
</tr>

<tr>
<td class="org-left">Windows</td>
<td class="org-left"><code>py -3.12</code></td>
<td class="org-left">Instaladores python.org o pyenv-win</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org6c5b467" class="outline-3">
<h3 id="org6c5b467">Método 1 — <code>venv</code> (incluido en Python, el más estándar)</h3>
<div class="outline-text-3" id="text-org6c5b467">
</div>
<div id="outline-container-org35ac8db" class="outline-4">
<h4 id="org35ac8db">Crear entorno con una versión específica</h4>
<div class="outline-text-4" id="text-org35ac8db">
<p>
La regla de oro:
</p>

<pre class="example" id="org0ab6b90">
&lt;python-DESEADA&gt; -m venv &lt;carpeta-del-entorno&gt;
</pre>
</div>
<ul class="org-ul">
<li><a id="org96651d6"></a>Linux<br />
<div class="outline-text-5" id="text-org96651d6">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #fe8019;">cd</span> ~/proyectos/mi_app
python3.12 -m venv .venv
<span style="color: #928374;"># </span><span style="color: #928374;">o con ruta expl&#237;cita si hay varias:
</span>/usr/bin/python3.11 -m venv .venv311
</pre>
</div>
</div>
</li>
<li><a id="org30e26bc"></a>macOS<br />
<div class="outline-text-5" id="text-org30e26bc">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #fe8019;">cd</span> ~/proyectos/mi_app
python3.12 -m venv .venv
<span style="color: #928374;"># </span><span style="color: #928374;">Si usas Homebrew y el binario tiene otro nombre:
</span>/opt/homebrew/bin/python3.12 -m venv .venv
</pre>
</div>
</div>
</li>
<li><a id="org8ad055f"></a>Windows (PowerShell)<br />
<div class="outline-text-5" id="text-org8ad055f">
<div class="org-src-container">
<pre class="src src-powershell">cd $HOME\proyectos\mi_app
py -3.12 -m venv .venv
# o ruta completa:
# C:\Users\tu\AppData\Local\Programs\Python\Python312\python.exe -m venv .venv
</pre>
</div>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgec0aea3" class="outline-4">
<h4 id="orgec0aea3">Activar el entorno</h4>
<div class="outline-text-4" id="text-orgec0aea3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sistema</th>
<th scope="col" class="org-left">Comando activar</th>
<th scope="col" class="org-left">Desactivar</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Linux / macOS</td>
<td class="org-left"><code>source .venv/bin/activate</code></td>
<td class="org-left"><code>deactivate</code></td>
</tr>

<tr>
<td class="org-left">Windows CMD</td>
<td class="org-left"><code>.venv\Scripts\activate.bat</code></td>
<td class="org-left"><code>deactivate</code></td>
</tr>

<tr>
<td class="org-left">Windows PowerShell</td>
<td class="org-left"><code>.venv\Scripts\Activate.ps1</code></td>
<td class="org-left"><code>deactivate</code></td>
</tr>
</tbody>
</table>

<p>
<b>PowerShell</b> puede bloquear scripts. Si falla:
</p>

<div class="org-src-container">
<pre class="src src-powershell">Set-ExecutionPolicy -ExecutionPolicy RemoteSigned -Scope CurrentUser
</pre>
</div>
</div>
</div>
<div id="outline-container-org67d42dc" class="outline-4">
<h4 id="org67d42dc">Comprobar que usas el Python correcto</h4>
<div class="outline-text-4" id="text-org67d42dc">
<p>
Tras activar:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #fe8019;">which</span> python
python --version
pip --version
</pre>
</div>

<p>
En Windows:
</p>

<div class="org-src-container">
<pre class="src src-powershell">Get-Command python
python --version
pip --version
</pre>
</div>

<p>
Debe apuntar a <code>.venv</code> (Linux/Mac) o <code>.venv\Scripts\python.exe</code> (Windows).
</p>
</div>
</div>
<div id="outline-container-orge83e696" class="outline-4">
<h4 id="orge83e696">Instalar paquetes y guardar dependencias</h4>
<div class="outline-text-4" id="text-orge83e696">
<div class="org-src-container">
<pre class="src src-shell">pip install --upgrade pip
pip install requests pandas
pip freeze &gt; requirements.txt
</pre>
</div>

<p>
En otra máquina o compañero:
</p>

<div class="org-src-container">
<pre class="src src-shell">python3.12 -m venv .venv
<span style="color: #fe8019;">source</span> .venv/bin/activate
pip install -r requirements.txt
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc1894e9" class="outline-4">
<h4 id="orgc1894e9">Borrar un entorno</h4>
<div class="outline-text-4" id="text-orgc1894e9">
<p>
Solo elimina la carpeta (con el entorno <b>desactivado</b>):
</p>

<div class="org-src-container">
<pre class="src src-shell">deactivate
rm -rf .venv
</pre>
</div>

<p>
Windows: <code>Remove-Item -Recurse -Force .venv</code>
</p>
</div>
</div>
</div>
<div id="outline-container-org4b86f82" class="outline-3">
<h3 id="org4b86f82">Método 2 — <b>pyenv</b> (varias versiones de Python en una máquina)</h3>
<div class="outline-text-3" id="text-org4b86f82">
</div>
<div id="outline-container-org2a9cc31" class="outline-4">
<h4 id="org2a9cc31">¿Cuándo usar pyenv?</h4>
<div class="outline-text-4" id="text-org2a9cc31">
<ul class="org-ul">
<li>Necesitas 3.10 para un proyecto viejo y 3.12 para uno nuevo.</li>
<li>No quieres mezclar el Python del sistema (Linux/macOS) con tus proyectos.</li>
<li>Quieres un comando global: <code>pyenv local 3.11.9</code> en una carpeta.</li>
</ul>
</div>
</div>
