introduccion_inteligencia_artificial.org
**** Linux (Debian/Ubuntu — dependencias + instalador oficial)

#+begin_src shell :exports code
sudo apt update
sudo apt install -y make build-essential libssl-dev zlib1g-dev \
  libbz2-dev libreadline-dev libsqlite3-dev curl git \
  libncursesw5-dev xz-utils tk-dev libxml2-dev libxmlsec1-dev libffi-dev liblzma-dev

curl https://pyenv.run | bash
# Añade a ~/.bashrc o ~/.zshrc:
# export PYENV_ROOT="$HOME/.pyenv"
# export PATH="$PYENV_ROOT/bin:$PATH"
# eval "$(pyenv init -)"
#+end_src

Reinicia la terminal y:

#+begin_src shell :exports code
pyenv --version
#+end_src

**** macOS (Homebrew)

#+begin_src shell :exports code
brew update
brew install pyenv
# Añade a ~/.zshrc:
# export PYENV_ROOT="$HOME/.pyenv"
# export PATH="$PYENV_ROOT/bin:$PATH"
# eval "$(pyenv init -)"
#+end_src

**** Windows — *pyenv-win*

En Windows el proyecto equivalente es [[https://github.com/pyenv-win/pyenv-win][pyenv-win]] (no es el mismo binario que Linux, pero la idea es igual).

#+begin_src powershell :exports code
# Con winget (si está disponible):
winget install pyenv-win.pyenv-win

# O clonar en %USERPROFILE%\.pyenv\pyenv-win
# y añadir a PATH las carpetas bin y shims
#+end_src

Consulta la wiki de pyenv-win para variables =PYENV=, =PYENV_ROOT=, =PYENV_HOME= en *Variables de entorno* de Windows.

*** Instalar versiones de Python con pyenv

#+begin_src shell :exports code
pyenv install --list | grep " 3.1"
pyenv install 3.11.9
pyenv install 3.12.4
pyenv versions
#+end_src

*** Elegir versión global o por carpeta

#+begin_src shell :exports code
pyenv global 3.12.4
pyenv local 3.11.9
cd ~/proyectos/legacy_app
pyenv local 3.10.13
python --version
#+end_src

=Crea archivo =.python-version= en la carpeta del proyecto.=

*** Entorno virtual con pyenv

Opción A — plugin =pyenv-virtualenv=:

#+begin_src shell :exports code
# Linux/macOS: instalar plugin pyenv-virtualenv (ver repo oficial)
pyenv virtualenv 3.12.4 mi_proyecto_312
pyenv local mi_proyecto_312
#+end_src

Opción B — =venv= clásico *después* de fijar versión con pyenv:

#+begin_src shell :exports code
pyenv local 3.12.4
python -m venv .venv
source .venv/bin/activate
#+end_src

** Método 3 — =virtualenv= (paquete pip)

Similar a =venv=, útil si necesitas opciones extra o Python muy antiguo.

#+begin_src shell :exports code
python3.12 -m pip install --user virtualenv
python3.12 -m user virtualenv .venv
# o:
virtualenv -p python3.11 .venv311
source .venv311/bin/activate
#+end_src

En la práctica moderna, =python -m venv= suele bastar.

** Método 4 — Conda / Miniconda (opcional, ciencia de datos)

*** Idea
Conda crea entornos con Python *y* librerías binarias (NumPy, CUDA) desde canales propios.

#+begin_src shell :exports code
conda create -n mi_env python=3.11
conda activate mi_env
conda install pandas numpy
conda deactivate
#+end_src

*** Conda vs venv

| Aspecto | venv / pyenv | conda |
|---------+--------------+-------|
| Peso | Ligero | Más pesado |
| Paquetes no-Python | No | Sí (R, C libs) |
| Curso general IA/Python | venv suele bastar | Si el curso pide Anaconda |

** Flujo de trabajo recomendado por escenario

*** Escenario A — Un solo proyecto, una versión fija (curso)

#+begin_example
1. Instalar Python 3.12 desde python.org / apt / brew
2. cd proyecto
3. python3.12 -m venv .venv
4. activar → pip install -r requirements.txt
5. Añadir .venv/ al .gitignore
#+end_example

*** Escenario B — Tres proyectos, tres versiones

#+begin_example
1. Instalar pyenv
2. pyenv install 3.10.13 3.11.9 3.12.4
3. En cada repo: pyenv local X.Y.Z && python -m venv .venv
#+end_example

*** Escenario C — Windows con lanzador py

#+begin_example
1. py -0p   (ver versiones)
2. py -3.12 -m venv .venv
3. .venv\Scripts\Activate.ps1
4. pip install ...
#+end_example

** Buenas prácticas

1. *Un entorno por proyecto* (carpeta =.venv= o =venv= dentro del repo).
2. *No subas* =.venv= a Git; sí sube =requirements.txt= o =pyproject.toml=.
3. *Nombra* la versión en el README: “Requiere Python ≥ 3.11”.
4. En Linux, evita =sudo pip install= en el Python del sistema (rompe paquetes del SO).
5. En macOS con Apple Silicon, prefiere builds *arm64* (Homebrew en =/opt/homebrew=).
6. Usa =python -m pip install= en lugar de =pip= suelto (asegura el pip del entorno activo).

** .gitignore mínimo

#+begin_example
.venv/
venv/
__pycache__/
*.pyc
.python-version   # opcional: algunos equipos sí lo versionan con pyenv
#+end_example

