index.html
<div id="outline-container-orgfdd3ee9" class="outline-4">
<h4 id="orgfdd3ee9">Instalación</h4>
<div class="outline-text-4" id="text-orgfdd3ee9">
</div>
<ul class="org-ul">
<li><a id="orgd20fe0f"></a>Linux (Debian/Ubuntu — dependencias + instalador oficial)<br />
<div class="outline-text-5" id="text-orgd20fe0f">
<div class="org-src-container">
<pre class="src src-shell">sudo apt update
sudo apt install -y make build-essential libssl-dev zlib1g-dev <span style="color: #b8bb26;">\</span>
  libbz2-dev libreadline-dev libsqlite3-dev curl git <span style="color: #b8bb26;">\</span>
  libncursesw5-dev xz-utils tk-dev libxml2-dev libxmlsec1-dev libffi-dev liblzma-dev

curl https://pyenv.run | bash
<span style="color: #928374;"># </span><span style="color: #928374;">A&#241;ade a ~/.bashrc o ~/.zshrc:
</span><span style="color: #928374;"># </span><span style="color: #928374;">export PYENV_ROOT="$HOME/.pyenv"
</span><span style="color: #928374;"># </span><span style="color: #928374;">export PATH="$PYENV_ROOT/bin:$PATH"
</span><span style="color: #928374;"># </span><span style="color: #928374;">eval "$(pyenv init -)"</span>
</pre>
</div>

<p>
Reinicia la terminal y:
</p>

<div class="org-src-container">
<pre class="src src-shell">pyenv --version
</pre>
</div>
</div>
</li>
<li><a id="orga10bf2b"></a>macOS (Homebrew)<br />
<div class="outline-text-5" id="text-orga10bf2b">
<div class="org-src-container">
<pre class="src src-shell">brew update
brew install pyenv
<span style="color: #928374;"># </span><span style="color: #928374;">A&#241;ade a ~/.zshrc:
</span><span style="color: #928374;"># </span><span style="color: #928374;">export PYENV_ROOT="$HOME/.pyenv"
</span><span style="color: #928374;"># </span><span style="color: #928374;">export PATH="$PYENV_ROOT/bin:$PATH"
</span><span style="color: #928374;"># </span><span style="color: #928374;">eval "$(pyenv init -)"</span>
</pre>
</div>
</div>
</li>
<li><a id="org0c71dc1"></a>Windows — <b>pyenv-win</b><br />
<div class="outline-text-5" id="text-org0c71dc1">
<p>
En Windows el proyecto equivalente es <a href="https://github.com/pyenv-win/pyenv-win">pyenv-win</a> (no es el mismo binario que Linux, pero la idea es igual).
</p>

<div class="org-src-container">
<pre class="src src-powershell"># Con winget (si está disponible):
winget install pyenv-win.pyenv-win

# O clonar en %USERPROFILE%\.pyenv\pyenv-win
# y añadir a PATH las carpetas bin y shims
</pre>
</div>

<p>
Consulta la wiki de pyenv-win para variables <code>PYENV</code>, <code>PYENV_ROOT</code>, <code>PYENV_HOME</code> en <b>Variables de entorno</b> de Windows.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6f8473d" class="outline-4">
<h4 id="org6f8473d">Instalar versiones de Python con pyenv</h4>
<div class="outline-text-4" id="text-org6f8473d">
<div class="org-src-container">
<pre class="src src-shell">pyenv install --list | grep <span style="color: #b8bb26;">" 3.1"</span>
pyenv install 3.11.9
pyenv install 3.12.4
pyenv versions
</pre>
</div>
</div>
</div>
<div id="outline-container-orge54133d" class="outline-4">
<h4 id="orge54133d">Elegir versión global o por carpeta</h4>
<div class="outline-text-4" id="text-orge54133d">
<div class="org-src-container">
<pre class="src src-shell">pyenv global 3.12.4
pyenv local 3.11.9
<span style="color: #fe8019;">cd</span> ~/proyectos/legacy_app
pyenv local 3.10.13
python --version
</pre>
</div>

<p>
<code>Crea archivo =.python-version</code> en la carpeta del proyecto.=
</p>
</div>
</div>
<div id="outline-container-org9ff7cfe" class="outline-4">
<h4 id="org9ff7cfe">Entorno virtual con pyenv</h4>
<div class="outline-text-4" id="text-org9ff7cfe">
<p>
Opción A — plugin <code>pyenv-virtualenv</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #928374;"># </span><span style="color: #928374;">Linux/macOS: instalar plugin pyenv-virtualenv (ver repo oficial)
</span>pyenv virtualenv 3.12.4 mi_proyecto_312
pyenv local mi_proyecto_312
</pre>
</div>

<p>
Opción B — <code>venv</code> clásico <b>después</b> de fijar versión con pyenv:
</p>

<div class="org-src-container">
<pre class="src src-shell">pyenv local 3.12.4
python -m venv .venv
<span style="color: #fe8019;">source</span> .venv/bin/activate
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd49c492" class="outline-3">
<h3 id="orgd49c492">Método 3 — <code>virtualenv</code> (paquete pip)</h3>
<div class="outline-text-3" id="text-orgd49c492">
<p>
Similar a <code>venv</code>, útil si necesitas opciones extra o Python muy antiguo.
</p>

<div class="org-src-container">
<pre class="src src-shell">python3.12 -m pip install --user virtualenv
python3.12 -m user virtualenv .venv
<span style="color: #928374;"># </span><span style="color: #928374;">o:
</span>virtualenv -p python3.11 .venv311
<span style="color: #fe8019;">source</span> .venv311/bin/activate
</pre>
</div>

<p>
En la práctica moderna, <code>python -m venv</code> suele bastar.
</p>
</div>
</div>
<div id="outline-container-org5821822" class="outline-3">
<h3 id="org5821822">Método 4 — Conda / Miniconda (opcional, ciencia de datos)</h3>
<div class="outline-text-3" id="text-org5821822">
</div>
<div id="outline-container-orgcd895c8" class="outline-4">
<h4 id="orgcd895c8">Idea</h4>
<div class="outline-text-4" id="text-orgcd895c8">
<p>
Conda crea entornos con Python <b>y</b> librerías binarias (NumPy, CUDA) desde canales propios.
</p>

<div class="org-src-container">
<pre class="src src-shell">conda create -n mi_env <span style="color: #83a598;">python</span>=3.11
conda activate mi_env
conda install pandas numpy
conda deactivate
</pre>
</div>
</div>
</div>
<div id="outline-container-org7e43bc6" class="outline-4">
<h4 id="org7e43bc6">Conda vs venv</h4>
<div class="outline-text-4" id="text-org7e43bc6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspecto</th>
<th scope="col" class="org-left">venv / pyenv</th>
<th scope="col" class="org-left">conda</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Peso</td>
<td class="org-left">Ligero</td>
<td class="org-left">Más pesado</td>
</tr>

<tr>
<td class="org-left">Paquetes no-Python</td>
<td class="org-left">No</td>
<td class="org-left">Sí (R, C libs)</td>
</tr>

<tr>
<td class="org-left">Curso general IA/Python</td>
<td class="org-left">venv suele bastar</td>
<td class="org-left">Si el curso pide Anaconda</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org550510d" class="outline-3">
<h3 id="org550510d">Flujo de trabajo recomendado por escenario</h3>
<div class="outline-text-3" id="text-org550510d">
</div>
<div id="outline-container-orgcf7c380" class="outline-4">
<h4 id="orgcf7c380">Escenario A — Un solo proyecto, una versión fija (curso)</h4>
<div class="outline-text-4" id="text-orgcf7c380">
<pre class="example" id="org32eca9d">
1. Instalar Python 3.12 desde python.org / apt / brew
2. cd proyecto
3. python3.12 -m venv .venv
4. activar → pip install -r requirements.txt
5. Añadir .venv/ al .gitignore
</pre>
</div>
</div>
<div id="outline-container-orgcbdcfb7" class="outline-4">
<h4 id="orgcbdcfb7">Escenario B — Tres proyectos, tres versiones</h4>
<div class="outline-text-4" id="text-orgcbdcfb7">
<pre class="example" id="org1733940">
1. Instalar pyenv
2. pyenv install 3.10.13 3.11.9 3.12.4
3. En cada repo: pyenv local X.Y.Z &amp;&amp; python -m venv .venv
</pre>
</div>
</div>
<div id="outline-container-org5c5b53d" class="outline-4">
<h4 id="org5c5b53d">Escenario C — Windows con lanzador py</h4>
<div class="outline-text-4" id="text-org5c5b53d">
<pre class="example" id="org18b36f2">
1. py -0p   (ver versiones)
2. py -3.12 -m venv .venv
3. .venv\Scripts\Activate.ps1
4. pip install ...
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1b7baf" class="outline-3">
<h3 id="orgb1b7baf">Buenas prácticas</h3>
<div class="outline-text-3" id="text-orgb1b7baf">
<ol class="org-ol">
<li><b>Un entorno por proyecto</b> (carpeta <code>.venv</code> o <code>venv</code> dentro del repo).</li>
<li><b>No subas</b> <code>.venv</code> a Git; sí sube <code>requirements.txt</code> o <code>pyproject.toml</code>.</li>
<li><b>Nombra</b> la versión en el README: “Requiere Python ≥ 3.11”.</li>
<li>En Linux, evita <code>sudo pip install</code> en el Python del sistema (rompe paquetes del SO).</li>
<li>En macOS con Apple Silicon, prefiere builds <b>arm64</b> (Homebrew en <code>/opt/homebrew</code>).</li>
<li>Usa <code>python -m pip install</code> en lugar de <code>pip</code> suelto (asegura el pip del entorno activo).</li>
</ol>
</div>
</div>
<div id="outline-container-org92c7766" class="outline-3">
<h3 id="org92c7766">.gitignore mínimo</h3>
<div class="outline-text-3" id="text-org92c7766">
<pre class="example" id="orga86556e">
.venv/
venv/
__pycache__/
*.pyc
.python-version   # opcional: algunos equipos sí lo versionan con pyenv
</pre>
</div>
</div>
