introduccion_inteligencia_artificial.org
** Problemas frecuentes y soluciones

| Síntoma | Causa probable | Solución |
|---------+----------------+----------|
| =python: command not found= | Python no en PATH | Instalar o usar ruta completa / pyenv |
| =No module named venv= | Paquete =python3-venv= falta (Debian) | =sudo apt install python3.12-venv= |
| Tras activar, =python= sigue siendo el del sistema | No activaste bien o orden PATH | =source .venv/bin/activate=; =which python= |
| PowerShell no activa | ExecutionPolicy | =RemoteSigned= para CurrentUser |
| =pip install= instala fuera del venv | Entorno no activo | Activar; usar =python -m pip= |
| pyenv: version not installed | Falta =pyenv install= | =pyenv install 3.12.4= |
| Mezcla 3.10 y 3.12 en mismo venv | Creaste venv con binario equivocado | Borrar .venv y recrear con binario correcto |

** Cheat sheet 

*** Linux / macOS

#+begin_example
# Crear
python3.12 -m venv .venv

# Activar / desactivar
source .venv/bin/activate
deactivate

# Paquetes
pip install -r requirements.txt
pip freeze > requirements.txt

# pyenv
pyenv install 3.12.4
pyenv local 3.12.4
#+end_example

*** Windows

#+begin_example
# Crear
py -3.12 -m venv .venv

# Activar (PowerShell)
.venv\Scripts\Activate.ps1

# Listar Pythons
py -0p
#+end_example

** Referencias
- Documentación oficial venv: https://docs.python.org/3/library/venv.html
- pyenv: https://github.com/pyenv/pyenv
- pyenv-win: https://github.com/pyenv-win/pyenv-win
- Python en Windows (launcher py): https://docs.python.org/3/using/windows.html

#+RESULTS:
: None


* Introducción a la Inteligencia Artificial

Este documento desarrolla el temario de la unidad introductoria a la *Inteligencia Artificial (IA)*: definición, historia, bases cognitivas, lógica, filosofía del conocimiento, modelos cognitivos y de agente, y el papel de la *heurística* con algoritmos de búsqueda.

*Objetivos generales:*
- Comprender qué se entiende por IA y cómo ha evolucionado históricamente.
- Relacionar la IA con psicología, lógica y filosofía del conocimiento.
- Describir el *modelo del agente inteligente* y sus extensiones (multiagente, ubicuo).
- Aplicar algoritmos de búsqueda informada y local como base de la resolución de problemas.

** 1.1 Introducción a la Inteligencia Artificial

*** ¿Qué es la Inteligencia Artificial?
La *Inteligencia Artificial* es el campo de la informática y las ciencias cognitivas que estudia cómo construir sistemas capaces de realizar tareas que, si las hiciera un humano, requerirían *inteligencia*: percibir, razonar, aprender, planificar, comunicarse y actuar en entornos complejos.

Definiciones frecuentes en cursos introductorios:
- *Sistemas que piensan como humanos* (enfoque cognitivo / simulación).
- *Sistemas que actúan racionalmente* (enfoque del *agente racional*; muy usado en IA moderna).
- *Sistemas que piensan racionalmente* (enfoque lógico: leyes del pensamiento).

*** Problemas típicos de la IA
| Área              | Ejemplos                                              |
|-------------------+-------------------------------------------------------|
| Percepción        | Visión por computadora, reconocimiento de voz         |
| Razonamiento      | Demostración de teoremas, diagnóstico médico            |
| Aprendizaje       | Clasificación, predicción, *deep learning*              |
| Lenguaje natural  | Traducción, chatbots, resumen de textos               |
| Planificación     | Robótica, logística, juegos (ajedrez, Go)             |
| Representación    | Ontologías, grafos de conocimiento, bases de reglas     |

*** IA débil vs IA fuerte (distinción conceptual)
- *IA débil (narrow AI):* sistemas especializados en una tarea (recomendador, detector de spam, asistente de voz). Es lo que existe hoy en producción.
- *IA fuerte (AGI):* hipotética inteligencia general al nivel humano o superior en *cualquier* dominio. Sigue siendo objeto de debate y especulación.

*** Relación con otras disciplinas
- *Psicología cognitiva:* modelos de memoria, atención, aprendizaje.
- *Lógica y matemáticas:* formalización del razonamiento.
- *Filosofía:* naturaleza del conocimiento, mente y consciencia.
- *Neurociencia:* inspiración biológica (redes neuronales).
- *Ingeniería:* sistemas que funcionan en el mundo real (robots, sensores, redes).

*** Idea clave del curso
La IA no es un solo método: es un *conjunto de técnicas* (búsqueda, lógica, probabilidad, aprendizaje automático, etc.) unidas por la pregunta: *¿cómo representar el conocimiento y elegir acciones útiles en un entorno?*

** 1.2 Historia de la Inteligencia Artificial

*** Orígenes (décadas de 1940–1950)
- *Alan Turing* (1950): artículo “Computing Machinery and Intelligence”; propone el *Test de Turing* como criterio operativo de comportamiento inteligente.
- *McCulloch y Pitts* (1943): modelo neuronal binario (antecedente de redes neuronales).
- Conferencia de *Dartmouth* (1956): McCarthy, Minsky, Shannon, Rochester y otros acuñan el término *“Artificial Intelligence”*. Se inicia el optimismo de que la inteligencia general sería alcanzable en pocos años.

*** Era del optimismo (1956–1974)
- Programas pioneros: *Logic Theorist*, *General Problem Solver* (GPS), primeros juegos (damas, ajedrez simplificado).
- Lenguaje *LISP* (McCarthy, 1958) como herramienta simbólica.
- Expectativas altas; financiamiento abundante.

*** Primer “invierno” de la IA (1974–1980)
- Limitaciones computacionales y teóricas (combinatoria explosiva, conocimiento difícil de codificar).
- Informe *Lighthill* (Reino Unido, 1973): crítica severa → recortes de fondos.

