index.html
<div id="outline-container-orga22795e" class="outline-3">
<h3 id="orga22795e">Problemas frecuentes y soluciones</h3>
<div class="outline-text-3" id="text-orga22795e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Síntoma</th>
<th scope="col" class="org-left">Causa probable</th>
<th scope="col" class="org-left">Solución</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>python: command not found</code></td>
<td class="org-left">Python no en PATH</td>
<td class="org-left">Instalar o usar ruta completa / pyenv</td>
</tr>

<tr>
<td class="org-left"><code>No module named venv</code></td>
<td class="org-left">Paquete <code>python3-venv</code> falta (Debian)</td>
<td class="org-left"><code>sudo apt install python3.12-venv</code></td>
</tr>

<tr>
<td class="org-left">Tras activar, <code>python</code> sigue siendo el del sistema</td>
<td class="org-left">No activaste bien o orden PATH</td>
<td class="org-left"><code>source .venv/bin/activate</code>; <code>which python</code></td>
</tr>

<tr>
<td class="org-left">PowerShell no activa</td>
<td class="org-left">ExecutionPolicy</td>
<td class="org-left"><code>RemoteSigned</code> para CurrentUser</td>
</tr>

<tr>
<td class="org-left"><code>pip install</code> instala fuera del venv</td>
<td class="org-left">Entorno no activo</td>
<td class="org-left">Activar; usar <code>python -m pip</code></td>
</tr>

<tr>
<td class="org-left">pyenv: version not installed</td>
<td class="org-left">Falta <code>pyenv install</code></td>
<td class="org-left"><code>pyenv install 3.12.4</code></td>
</tr>

<tr>
<td class="org-left">Mezcla 3.10 y 3.12 en mismo venv</td>
<td class="org-left">Creaste venv con binario equivocado</td>
<td class="org-left">Borrar .venv y recrear con binario correcto</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org35ca76a" class="outline-3">
<h3 id="org35ca76a">Cheat sheet</h3>
<div class="outline-text-3" id="text-org35ca76a">
</div>
<div id="outline-container-org070ae42" class="outline-4">
<h4 id="org070ae42">Linux / macOS</h4>
<div class="outline-text-4" id="text-org070ae42">
<pre class="example" id="org140fe05">
# Crear
python3.12 -m venv .venv

# Activar / desactivar
source .venv/bin/activate
deactivate

# Paquetes
pip install -r requirements.txt
pip freeze &gt; requirements.txt

# pyenv
pyenv install 3.12.4
pyenv local 3.12.4
</pre>
</div>
</div>
<div id="outline-container-orgdb1df7f" class="outline-4">
<h4 id="orgdb1df7f">Windows</h4>
<div class="outline-text-4" id="text-orgdb1df7f">
<pre class="example" id="orgf825441">
# Crear
py -3.12 -m venv .venv

# Activar (PowerShell)
.venv\Scripts\Activate.ps1

# Listar Pythons
py -0p
</pre>
</div>
</div>
</div>
<div id="outline-container-org3920d27" class="outline-3">
<h3 id="org3920d27">Referencias</h3>
<div class="outline-text-3" id="text-org3920d27">
<ul class="org-ul">
<li>Documentación oficial venv: <a href="https://docs.python.org/3/library/venv.html">https://docs.python.org/3/library/venv.html</a></li>
<li>pyenv: <a href="https://github.com/pyenv/pyenv">https://github.com/pyenv/pyenv</a></li>
<li>pyenv-win: <a href="https://github.com/pyenv-win/pyenv-win">https://github.com/pyenv-win/pyenv-win</a></li>
<li>Python en Windows (launcher py): <a href="https://docs.python.org/3/using/windows.html">https://docs.python.org/3/using/windows.html</a></li>
</ul>

<pre class="example">
None
</pre>
</div>
</div>
</div>
<div id="outline-container-org78417fa" class="outline-2">
<h2 id="org78417fa">Introducción a la Inteligencia Artificial</h2>
<div class="outline-text-2" id="text-org78417fa">
<p>
Este documento desarrolla el temario de la unidad introductoria a la <b>Inteligencia Artificial (IA)</b>: definición, historia, bases cognitivas, lógica, filosofía del conocimiento, modelos cognitivos y de agente, y el papel de la <b>heurística</b> con algoritmos de búsqueda.
</p>

<p>
<b>Objetivos generales:</b>
</p>
<ul class="org-ul">
<li>Comprender qué se entiende por IA y cómo ha evolucionado históricamente.</li>
<li>Relacionar la IA con psicología, lógica y filosofía del conocimiento.</li>
<li>Describir el <b>modelo del agente inteligente</b> y sus extensiones (multiagente, ubicuo).</li>
<li>Aplicar algoritmos de búsqueda informada y local como base de la resolución de problemas.</li>
</ul>
</div>
<div id="outline-container-org15950e7" class="outline-3">
<h3 id="org15950e7">1.1 Introducción a la Inteligencia Artificial</h3>
<div class="outline-text-3" id="text-org15950e7">
</div>
<div id="outline-container-orge713d5f" class="outline-4">
<h4 id="orge713d5f">¿Qué es la Inteligencia Artificial?</h4>
<div class="outline-text-4" id="text-orge713d5f">
<p>
La <b>Inteligencia Artificial</b> es el campo de la informática y las ciencias cognitivas que estudia cómo construir sistemas capaces de realizar tareas que, si las hiciera un humano, requerirían <b>inteligencia</b>: percibir, razonar, aprender, planificar, comunicarse y actuar en entornos complejos.
</p>

<p>
Definiciones frecuentes en cursos introductorios:
</p>
<ul class="org-ul">
<li><b>Sistemas que piensan como humanos</b> (enfoque cognitivo / simulación).</li>
<li><b>Sistemas que actúan racionalmente</b> (enfoque del <b>agente racional</b>; muy usado en IA moderna).</li>
<li><b>Sistemas que piensan racionalmente</b> (enfoque lógico: leyes del pensamiento).</li>
</ul>
</div>
</div>
<div id="outline-container-org666fb99" class="outline-4">
<h4 id="org666fb99">Problemas típicos de la IA</h4>
<div class="outline-text-4" id="text-org666fb99">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Área</th>
<th scope="col" class="org-left">Ejemplos</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Percepción</td>
<td class="org-left">Visión por computadora, reconocimiento de voz</td>
</tr>

<tr>
<td class="org-left">Razonamiento</td>
<td class="org-left">Demostración de teoremas, diagnóstico médico</td>
</tr>

<tr>
<td class="org-left">Aprendizaje</td>
<td class="org-left">Clasificación, predicción, <b>deep learning</b></td>
</tr>

<tr>
<td class="org-left">Lenguaje natural</td>
<td class="org-left">Traducción, chatbots, resumen de textos</td>
</tr>

<tr>
<td class="org-left">Planificación</td>
<td class="org-left">Robótica, logística, juegos (ajedrez, Go)</td>
</tr>

<tr>
<td class="org-left">Representación</td>
<td class="org-left">Ontologías, grafos de conocimiento, bases de reglas</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org03c86f6" class="outline-4">
<h4 id="org03c86f6">IA débil vs IA fuerte (distinción conceptual)</h4>
<div class="outline-text-4" id="text-org03c86f6">
<ul class="org-ul">
<li><b>IA débil (narrow AI):</b> sistemas especializados en una tarea (recomendador, detector de spam, asistente de voz). Es lo que existe hoy en producción.</li>
<li><b>IA fuerte (AGI):</b> hipotética inteligencia general al nivel humano o superior en <b>cualquier</b> dominio. Sigue siendo objeto de debate y especulación.</li>
</ul>
</div>
</div>
<div id="outline-container-org41e6a26" class="outline-4">
<h4 id="org41e6a26">Relación con otras disciplinas</h4>
<div class="outline-text-4" id="text-org41e6a26">
<ul class="org-ul">
<li><b>Psicología cognitiva:</b> modelos de memoria, atención, aprendizaje.</li>
<li><b>Lógica y matemáticas:</b> formalización del razonamiento.</li>
<li><b>Filosofía:</b> naturaleza del conocimiento, mente y consciencia.</li>
<li><b>Neurociencia:</b> inspiración biológica (redes neuronales).</li>
<li><b>Ingeniería:</b> sistemas que funcionan en el mundo real (robots, sensores, redes).</li>
</ul>
</div>
</div>
<div id="outline-container-org47792dd" class="outline-4">
<h4 id="org47792dd">Idea clave del curso</h4>
<div class="outline-text-4" id="text-org47792dd">
<p>
La IA no es un solo método: es un <b>conjunto de técnicas</b> (búsqueda, lógica, probabilidad, aprendizaje automático, etc.) unidas por la pregunta: <b>¿cómo representar el conocimiento y elegir acciones útiles en un entorno?</b>
</p>
</div>
</div>
</div>
<div id="outline-container-orga07e4e1" class="outline-3">
<h3 id="orga07e4e1">1.2 Historia de la Inteligencia Artificial</h3>
<div class="outline-text-3" id="text-orga07e4e1">
</div>
<div id="outline-container-orgad01b66" class="outline-4">
<h4 id="orgad01b66">Orígenes (décadas de 1940–1950)</h4>
<div class="outline-text-4" id="text-orgad01b66">
<ul class="org-ul">
<li><b>Alan Turing</b> (1950): artículo “Computing Machinery and Intelligence”; propone el <b>Test de Turing</b> como criterio operativo de comportamiento inteligente.</li>
<li><b>McCulloch y Pitts</b> (1943): modelo neuronal binario (antecedente de redes neuronales).</li>
<li>Conferencia de <b>Dartmouth</b> (1956): McCarthy, Minsky, Shannon, Rochester y otros acuñan el término <b>“Artificial Intelligence”</b>. Se inicia el optimismo de que la inteligencia general sería alcanzable en pocos años.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd41a117" class="outline-4">
<h4 id="orgd41a117">Era del optimismo (1956–1974)</h4>
<div class="outline-text-4" id="text-orgd41a117">
<ul class="org-ul">
<li>Programas pioneros: <b>Logic Theorist</b>, <b>General Problem Solver</b> (GPS), primeros juegos (damas, ajedrez simplificado).</li>
<li>Lenguaje <b>LISP</b> (McCarthy, 1958) como herramienta simbólica.</li>
<li>Expectativas altas; financiamiento abundante.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4f85d8" class="outline-4">
<h4 id="orgb4f85d8">Primer “invierno” de la IA (1974–1980)</h4>
<div class="outline-text-4" id="text-orgb4f85d8">
<ul class="org-ul">
<li>Limitaciones computacionales y teóricas (combinatoria explosiva, conocimiento difícil de codificar).</li>
<li>Informe <b>Lighthill</b> (Reino Unido, 1973): crítica severa → recortes de fondos.</li>
</ul>
</div>
</div>
