index.html
<div id="outline-container-org1b736d8" class="outline-4">
<h4 id="org1b736d8">Sistemas expertos y boom comercial (1980–1987)</h4>
<div class="outline-text-4" id="text-org1b736d8">
<ul class="org-ul">
<li><b>Sistemas basados en reglas</b> (IF–THEN): MYCIN (diagnóstico), DENDRAL (química).</li>
<li>Japón: <b>Fifth Generation</b>; EE.UU.: proyectos DARPA.</li>
<li>Éxito en dominios acotados con expertos humanos disponibles.</li>
</ul>
</div>
</div>
<div id="outline-container-orge9bb24d" class="outline-4">
<h4 id="orge9bb24d">Segundo invierno (1987–1993)</h4>
<div class="outline-text-4" id="text-orge9bb24d">
<ul class="org-ul">
<li>Caída del hardware LISP; sistemas expertos caros de mantener y frágiles fuera de su nicho.</li>
<li>Necesidad de <b>aprendizaje</b> y <b>datos</b> frente a solo reglas manuales.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf4352b6" class="outline-4">
<h4 id="orgf4352b6">Resurgimiento: aprendizaje automático y datos (1990–2010)</h4>
<div class="outline-text-4" id="text-orgf4352b6">
<ul class="org-ul">
<li><b>Aprendizaje estadístico</b>: SVM, árboles, <b>boosting</b>.</li>
<li>Éxitos prácticos: filtrado de spam, reconocimiento de escritura, recomendación.</li>
<li><b>Deep Blue</b> vence a Kasparov (1997) con búsqueda + heurísticas + hardware.</li>
</ul>
</div>
</div>
<div id="outline-container-org4ef867a" class="outline-4">
<h4 id="org4ef867a">Era del <b>deep learning</b> (2010–presente)</h4>
<div class="outline-text-4" id="text-org4ef867a">
<ul class="org-ul">
<li>GPUs, grandes conjuntos de datos (ImageNet), arquitecturas profundas (CNN, RNN, Transformers).</li>
<li>Hitos: AlexNet (2012), AlphaGo (2016), GPT y modelos de lenguaje a gran escala (2020+).</li>
<li>IA generativa, visión, voz, asistentes conversacionales.</li>
</ul>
</div>
</div>
<div id="outline-container-org5adce46" class="outline-4">
<h4 id="org5adce46">Línea de tiempo resumida</h4>
<div class="outline-text-4" id="text-org5adce46">
<pre class="example" id="org986d78f">
1943  Modelo McCulloch-Pitts
1950  Test de Turing
1956  Dartmouth → nace el término "IA"
1960s GPS, ELIZA, optimismo
1974  Primer invierno (Lighthill)
1980s Sistemas expertos
1987  Segundo invierno
1997  Deep Blue vs Kasparov
2012  AlexNet / revolución deep learning
2016  AlphaGo
2020+ LLMs, IA generativa
</pre>
</div>
</div>
</div>
<div id="outline-container-org1f24d0d" class="outline-3">
<h3 id="org1f24d0d">1.3 Habilidades cognoscitivas y teorías de la inteligencia</h3>
<div class="outline-text-3" id="text-org1f24d0d">
</div>
<div id="outline-container-org72b3768" class="outline-4">
<h4 id="org72b3768">Habilidades cognoscitivas (psicología)</h4>
<div class="outline-text-4" id="text-org72b3768">
<p>
Desde la psicología cognitiva, la “inteligencia” en humanos se manifiesta en procesos interrelacionados:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Proceso</th>
<th scope="col" class="org-left">Descripción breve</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Percepción</td>
<td class="org-left">Interpretar estímulos sensoriales</td>
</tr>

<tr>
<td class="org-left">Atención</td>
<td class="org-left">Seleccionar información relevante</td>
</tr>

<tr>
<td class="org-left">Memoria</td>
<td class="org-left">Almacenar y recuperar (corto/largo plazo)</td>
</tr>

<tr>
<td class="org-left">Lenguaje</td>
<td class="org-left">Comprender y producir símbolos lingüísticos</td>
</tr>

<tr>
<td class="org-left">Razonamiento</td>
<td class="org-left">Inferir conclusiones, resolver problemas</td>
</tr>

<tr>
<td class="org-left">Aprendizaje</td>
<td class="org-left">Modificar conducta o conocimiento con la experiencia</td>
</tr>

<tr>
<td class="org-left">Metacognición</td>
<td class="org-left">“Pensar sobre el propio pensamiento”</td>
</tr>
</tbody>
</table>

<p>
La IA clásica intentó <b>modelar</b> o <b>replicar</b> estos procesos; la IA moderna a menudo los <b>aproxima</b> con datos y optimización sin pretender fidelidad biológica.
</p>
</div>
</div>
<div id="outline-container-org0f9de86" class="outline-4">
<h4 id="org0f9de86">Teoría conductista (conductismo)</h4>
<div class="outline-text-4" id="text-org0f9de86">
<ul class="org-ul">
<li><b>Enfoque:</b> la mente no se observa directamente; se estudia el <b>comportamiento</b> ante estímulos y reforzadores.</li>
<li><b>Skinner, Watson:</b> aprendizaje por condicionamiento y refuerzo.</li>
<li><b>Relevancia en IA:</b> <b>aprendizaje por refuerzo</b> (RL): agente, estados, acciones, recompensas (Q-learning, policy gradient). El “conductismo” inspira el marco matemático, no la negación de representaciones internas (los agentes RL sí mantienen valores o políticas).</li>
</ul>
</div>
</div>
<div id="outline-container-org3b326e8" class="outline-4">
<h4 id="org3b326e8">Teoría de la inteligencia general (factor <b>g</b>)</h4>
<div class="outline-text-4" id="text-org3b326e8">
<ul class="org-ul">
<li><b>Spearman:</b> un factor común subyace a varias pruebas cognitivas.</li>
<li>En IA: analogía limitada; los sistemas suelen ser <b>especialistas</b> (alto rendimiento en una tarea, bajo en otras).</li>
</ul>
</div>
</div>
<div id="outline-container-org2f0ee91" class="outline-4">
<h4 id="org2f0ee91">Inteligencias múltiples (Howard Gardner)</h4>
<div class="outline-text-4" id="text-org2f0ee91">
<p>
Gardner propone varias inteligencias relativamente independientes:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Inteligencia</th>
<th scope="col" class="org-left">Ejemplo humano</th>
<th scope="col" class="org-left">Paralelo en IA (aproximado)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Lingüística</td>
<td class="org-left">Leer, escribir, debatir</td>
<td class="org-left">NLP, LLMs</td>
</tr>

<tr>
<td class="org-left">Lógico-matemática</td>
<td class="org-left">Demostrar, programar</td>
<td class="org-left">Lógica, planificación, ML simbólico</td>
</tr>

<tr>
<td class="org-left">Espacial</td>
<td class="org-left">Orientarse, dibujar</td>
<td class="org-left">Visión, SLAM, gráficos</td>
</tr>

<tr>
<td class="org-left">Musical</td>
<td class="org-left">Componer, reconocer tonos</td>
<td class="org-left">Generación/análisis musical</td>
</tr>

<tr>
<td class="org-left">Corporal-kinestésica</td>
<td class="org-left">Deportes, manualidades</td>
<td class="org-left">Robótica, control motor</td>
</tr>

<tr>
<td class="org-left">Interpersonal</td>
<td class="org-left">Empatía, liderazgo</td>
<td class="org-left">Análisis de sentimientos (parcial)</td>
</tr>

<tr>
<td class="org-left">Intrapersonal</td>
<td class="org-left">Autoconocimiento</td>
<td class="org-left">Poco modelado explícitamente</td>
</tr>

<tr>
<td class="org-left">Naturalista</td>
<td class="org-left">Clasificar especies</td>
<td class="org-left">Clasificación de imágenes</td>
</tr>
</tbody>
</table>

<p>
<b>Idea pedagógica:</b> no existe un solo “botón de inteligencia”; los sistemas actuales combinan módulos especializados.
</p>
</div>
</div>
<div id="outline-container-orgfde6ca3" class="outline-4">
<h4 id="orgfde6ca3">Otras teorías (mención)</h4>
<div class="outline-text-4" id="text-orgfde6ca3">
<ul class="org-ul">
<li><b>Piaget:</b> desarrollo por etapas (sensoriomotor → formal). Útil como metáfora de complejidad creciente en agentes que aprenden.</li>
<li><b>Vygotsky:</b> aprendizaje social y <b>zona de desarrollo próximo</b>. Paralelo: <b>aprendizaje con humano en el bucle</b> (RLHF, anotación humana).</li>
<li><b>Sternberg (triárquica):</b> analítica, creativa, práctica → diseño de sistemas que equilibren precisión, novedad y utilidad en contexto.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd3021c4" class="outline-3">
<h3 id="orgd3021c4">1.4 Razonamiento según la lógica</h3>
<div class="outline-text-3" id="text-orgd3021c4">
</div>
<div id="outline-container-org593b839" class="outline-4">
<h4 id="org593b839">Lógica como fundamento del razonamiento automático</h4>
<div class="outline-text-4" id="text-org593b839">
<p>
La lógica formal permite:
</p>
<ul class="org-ul">
<li>Representar <b>proposiciones</b> y <b>relaciones</b>.</li>
<li>Derivar <b>conclusiones válidas</b> a partir de <b>premisas</b>.</li>
<li>Verificar si un argumento es <b>correcto</b> (independientemente de si las premisas son verdaderas en el mundo real).</li>
</ul>
</div>
</div>
<div id="outline-container-orgf5c82df" class="outline-4">
<h4 id="orgf5c82df">Componentes básicos</h4>
<div class="outline-text-4" id="text-orgf5c82df">
<ul class="org-ul">
<li><b>Lenguaje formal:</b> símbolos, conectivos (∧, ∨, ¬, →), cuantificadores (∀, ∃).</li>
<li><b>Axiomas:</b> proposiciones <b>asumidas</b> sin demostración dentro del sistema (punto de partida).</li>
<li><b>Teoremas:</b> proposiciones <b>demostrables</b> a partir de axiomas y reglas de inferencia.</li>
<li><b>Demostración:</b> secuencia finita de pasos donde cada paso es un axioma, una hipótesis o se obtiene por una <b>regla de inferencia</b> (p. ej. <b>modus ponens</b>: de P y P→Q inferir Q).</li>
</ul>
</div>
</div>
<div id="outline-container-orgdb1e915" class="outline-4">
<h4 id="orgdb1e915">Ejemplo mínimo (lógica proposicional)</h4>
<div class="outline-text-4" id="text-orgdb1e915">
<p>
Premisas:
</p>
<ol class="org-ol">
<li>Si llueve, la calle está mojada.  (Lluvia → Mojada)</li>
<li>Está lloviendo.                    (Lluvia)</li>
</ol>

<p>
Conclusión (por modus ponens): La calle está mojada. (Mojada)
</p>

<p>
En notación: {(Lluvia → Mojada), Lluvia} ⊢ Mojada
</p>
</div>
</div>
