index.html
<div id="outline-container-orgb7b7b2c" class="outline-4">
<h4 id="orgb7b7b2c">Sistemas formales relevantes en IA</h4>
<div class="outline-text-4" id="text-orgb7b7b2c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sistema</th>
<th scope="col" class="org-left">Uso en IA</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Lógica proposicional</td>
<td class="org-left">Reglas simples, verificación finita</td>
</tr>

<tr>
<td class="org-left">Lógica de predicados</td>
<td class="org-left">Relaciones, bases de conocimiento</td>
</tr>

<tr>
<td class="org-left">Lógica modal</td>
<td class="org-left">Conocimiento, creencia, obligación (agentes)</td>
</tr>

<tr>
<td class="org-left">Lógica difusa</td>
<td class="org-left">Razonamiento con grados de verdad</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org030ea67" class="outline-4">
<h4 id="org030ea67">Límites importantes</h4>
<div class="outline-text-4" id="text-org030ea67">
<ul class="org-ul">
<li><b>Decidibilidad:</b> algunos problemas no tienen algoritmo que siempre termine con respuesta correcta.</li>
<li><b>Complejidad:</b> el espacio de búsqueda de demostraciones crece muy rápido → hace falta <b>heurística</b> (sección 1.8).</li>
<li><b>Mundo real:</b> la lógica clásica asume certeza; en la práctica hay incertidumbre (probabilidad, redes bayesianas).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org32cec4d" class="outline-3">
<h3 id="org32cec4d">1.5 Adquisición del conocimiento según la filosofía</h3>
<div class="outline-text-3" id="text-org32cec4d">
</div>
<div id="outline-container-org7ee6d35" class="outline-4">
<h4 id="org7ee6d35">¿Qué es el conocimiento? (epistemología)</h4>
<div class="outline-text-4" id="text-org7ee6d35">
<p>
La <b>filosofía del conocimiento</b> pregunta:
</p>
<ul class="org-ul">
<li>¿Qué distingue <b>conocimiento</b> de mera <b>creencia</b>?</li>
<li>¿De dónde proviene? (experiencia vs razón)</li>
<li>¿Cómo sabemos que algo es <b>justificado</b>?</li>
</ul>

<p>
Tradición clásica: <b>conocimiento = creencia verdadera justificada</b> (definición discutida, pero pedagógicamente útil).
</p>
</div>
</div>
<div id="outline-container-orgb3d33b4" class="outline-4">
<h4 id="orgb3d33b4">Empirismo vs racionalismo</h4>
<div class="outline-text-4" id="text-orgb3d33b4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Corriente</th>
<th scope="col" class="org-left">Idea principal</th>
<th scope="col" class="org-left">Paralelo en IA</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Empirismo</td>
<td class="org-left">Conocimiento desde la experiencia</td>
<td class="org-left">Aprendizaje automático, datos, inducción</td>
</tr>

<tr>
<td class="org-left">Racionalismo</td>
<td class="org-left">Conocimiento desde la razón innata</td>
<td class="org-left">Axiomas, ontologías, reglas a priori</td>
</tr>
</tbody>
</table>

<p>
Los sistemas reales suelen combinar <b>conocimiento codificado</b> (reglas, ontologías) con <b>conocimiento aprendido</b> (modelos entrenados).
</p>
</div>
</div>
<div id="outline-container-orgfc7928c" class="outline-4">
<h4 id="orgfc7928c">Fuentes de conocimiento en sistemas inteligentes</h4>
<div class="outline-text-4" id="text-orgfc7928c">
<ol class="org-ol">
<li><b>Codificación manual:</b> expertos escriben reglas (sistemas expertos).</li>
<li><b>Aprendizaje inductivo:</b> generalizar patrones desde ejemplos.</li>
<li><b>Adquisición semi-automática:</b> extracción de texto, minería de datos.</li>
<li><b>Interacción:</b> el usuario corrige o etiqueta (aprendizaje activo).</li>
</ol>
</div>
</div>
<div id="outline-container-orgabe6efe" class="outline-4">
<h4 id="orgabe6efe">Problema de la adquisición de conocimiento (<b>knowledge acquisition bottleneck</b>)</h4>
<div class="outline-text-4" id="text-orgabe6efe">
<ul class="org-ul">
<li>Los expertos no siempre saben articular lo que hacen.</li>
<li>El mantenimiento de reglas es costoso.</li>
<li>Motivación histórica del <b>machine learning</b>: aprender reglas o parámetros desde datos.</li>
</ul>
</div>
</div>
<div id="outline-container-org3d4514e" class="outline-4">
<h4 id="org3d4514e">Representación del conocimiento (puente filosofía → IA)</h4>
<div class="outline-text-4" id="text-org3d4514e">
<ul class="org-ul">
<li><b>Hechos:</b> “París es capital de Francia.”</li>
<li><b>Reglas:</b> “Si X es padre de Y, Y es hijo de X.”</li>
<li><b>Ontologías:</b> vocabulario formal de conceptos y relaciones.</li>
<li><b>Frames / redes semánticas:</b> estructuras con herencia y slots.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org06cac20" class="outline-3">
<h3 id="org06cac20">1.6 El modelo cognoscitivo</h3>
<div class="outline-text-3" id="text-org06cac20">
</div>
<div id="outline-container-orgae617b5" class="outline-4">
<h4 id="orgae617b5">Definición</h4>
<div class="outline-text-4" id="text-orgae617b5">
<p>
Un <b>modelo cognoscitivo</b> es una representación computacional de procesos mentales: cómo se percibe, se recuerda, se razona y se decide. Busca coherencia con evidencia psicológica o neurocientífica (a veces de forma simplificada).
</p>
</div>
</div>
<div id="outline-container-orgf819a7c" class="outline-4">
<h4 id="orgf819a7c">Arquitecturas cognitivas clásicas</h4>
<div class="outline-text-4" id="text-orgf819a7c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Arquitectura</th>
<th scope="col" class="org-left">Idea central</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SOAR</td>
<td class="org-left">Memoria, aprendizaje por <b>chunking</b>, resolución de impasse</td>
</tr>

<tr>
<td class="org-left">ACT-R</td>
<td class="org-left">Módulos (declarativo/procedimental), activación</td>
</tr>

<tr>
<td class="org-left">CLARION</td>
<td class="org-left">Conocimiento implícito vs explícito</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org785198a" class="outline-4">
<h4 id="org785198a">Componentes típicos de un modelo cognoscitivo</h4>
<div class="outline-text-4" id="text-org785198a">
<ul class="org-ul">
<li><b>Memoria de trabajo:</b> buffer limitado para información actual.</li>
<li><b>Memoria a largo plazo:</b> hechos y procedimientos.</li>
<li><b>Percepción y motor:</b> interfaces con el entorno.</li>
<li><b>Aprendizaje:</b> consolidación de experiencias en conocimiento reutilizable.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfae425b" class="outline-4">
<h4 id="orgfae425b">Modelo cognoscitivo vs modelo de agente</h4>
<div class="outline-text-4" id="text-orgfae425b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Aspecto</th>
<th scope="col" class="org-left">Modelo cognoscitivo</th>
<th scope="col" class="org-left">Agente inteligente (IA clásica)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Objetivo</td>
<td class="org-left">Simular mente humana</td>
<td class="org-left">Actuar bien en un entorno</td>
</tr>

<tr>
<td class="org-left">Evaluación</td>
<td class="org-left">Ajuste a datos psicológicos</td>
<td class="org-left">Rendimiento (tarea, utilidad)</td>
</tr>

<tr>
<td class="org-left">Complejidad</td>
<td class="org-left">Alta fidelidad cognitiva</td>
<td class="org-left">Pragmática, a veces mínima</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org164dd7f" class="outline-4">
<h4 id="org164dd7f">Conexión con IA moderna</h4>
<div class="outline-text-4" id="text-org164dd7f">
<p>
Las redes neuronales profundas no suelen pretender ser modelos cognitivos fieles, pero incorporan ideas inspiradas en cerebro (capas, atención). Los <b>LLMs</b> debaten si emergen capacidades “cognitivas” sin modelo explícito de mente.
</p>
</div>
</div>
</div>
<div id="outline-container-orgc8ede65" class="outline-3">
<h3 id="orgc8ede65">1.7 Modelo del agente inteligente</h3>
<div class="outline-text-3" id="text-orgc8ede65">
</div>
<div id="outline-container-org3c0353d" class="outline-4">
<h4 id="org3c0353d">Definición de agente</h4>
<div class="outline-text-4" id="text-org3c0353d">
<p>
Un <b>agente</b> es cualquier cosa que percibe su <b>entorno</b> mediante <b>sensores</b> y actúa sobre él mediante <b>actuadores</b>.
</p>

<p>
Un <b>agente inteligente</b> elige acciones que maximizan una medida de <b>rendimiento</b> según su <b>secuencia perceptiva</b> y su <b>conocimiento</b> incorporado.
</p>
</div>
</div>
<div id="outline-container-org4cf9ce4" class="outline-4">
<h4 id="org4cf9ce4">Función agente</h4>
<div class="outline-text-4" id="text-org4cf9ce4">
<p>
\[ f: P^* \rightarrow A \]
donde P es el conjunto de percepciones y A el de acciones.
</p>

<p>
En la práctica se implementa con <b>programa + arquitectura</b> (cuerpo físico o software).
</p>
</div>
</div>
<div id="outline-container-org639386b" class="outline-4">
<h4 id="org639386b">Componentes de un agente racional</h4>
<div class="outline-text-4" id="text-org639386b">
<ol class="org-ol">
<li><b>Medida de rendimiento:</b> qué se considera éxito (seguridad, puntos, tiempo, costo).</li>
<li><b>Conocimiento del entorno:</b> reglas, mapas, modelos probabilísticos.</li>
<li><b>Secuencia perceptiva:</b> historial de lo observado.</li>
<li><b>Acción:</b> la mejor según expectativa de rendimiento futuro.</li>
</ol>
</div>
</div>
