index.html
<div id="outline-container-orgc28775c" class="outline-4">
<h4 id="orgc28775c">Tipos de agentes (Jersey / Russell &amp; Norvig)</h4>
<div class="outline-text-4" id="text-orgc28775c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo</th>
<th scope="col" class="org-left">Comportamiento</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reflejo simple</td>
<td class="org-left">Acción = función de percepción actual</td>
</tr>

<tr>
<td class="org-left">Reflejo basado en modelo</td>
<td class="org-left">Mantiene estado interno (modelo del mundo)</td>
</tr>

<tr>
<td class="org-left">Basado en objetivos</td>
<td class="org-left">Planifica para alcanzar metas</td>
</tr>

<tr>
<td class="org-left">Basado en utilidad</td>
<td class="org-left">Elige entre metas con grados de preferencia</td>
</tr>

<tr>
<td class="org-left">De aprendizaje</td>
<td class="org-left">Mejora su comportamiento con la experiencia</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgd7e88c8" class="outline-4">
<h4 id="orgd7e88c8">PEAS (ejemplo: taxi autónomo)</h4>
<div class="outline-text-4" id="text-orgd7e88c8">
<ul class="org-ul">
<li><b>Performance:</b> seguridad, rapidez, comodidad, legalidad.</li>
<li><b>Environment:</b> calles, tráfico, peatones, clima.</li>
<li><b>Actuators:</b> volante, acelerador, freno, señales.</li>
<li><b>Sensors:</b> cámaras, LIDAR, GPS, odometría.</li>
</ul>
</div>
</div>
<div id="outline-container-orga171320" class="outline-4">
<h4 id="orga171320">Propiedades del entorno (para elegir técnica)</h4>
<div class="outline-text-4" id="text-orga171320">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Propiedad</th>
<th scope="col" class="org-left">Ejemplos</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Observable / no</td>
<td class="org-left">Ajedrez completo vs taxi con puntos ciegos</td>
</tr>

<tr>
<td class="org-left">Determinista / no</td>
<td class="org-left">Laberinto fijo vs poker</td>
</tr>

<tr>
<td class="org-left">Episódico / secuencial</td>
<td class="org-left">Clasificar imagen vs ajedrez</td>
</tr>

<tr>
<td class="org-left">Estático / dinámico</td>
<td class="org-left">Rompecabezas vs fútbol robótico</td>
</tr>

<tr>
<td class="org-left">Discreto / continuo</td>
<td class="org-left">Tablero vs conducción continua</td>
</tr>

<tr>
<td class="org-left">Un agente / multi</td>
<td class="org-left">Solitario vs subastas, tráfico</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org88e292e" class="outline-4">
<h4 id="org88e292e">Sistemas multiagente (SMA)</h4>
<div class="outline-text-4" id="text-org88e292e">
<ul class="org-ul">
<li>Varios agentes en un <b>mismo entorno</b>; pueden cooperar, competir o ser neutros.</li>
<li><b>Cooperación:</b> robots en almacén, enjambres.</li>
<li><b>Competencia:</b> subastas, juegos, mercados.</li>
<li>Desafíos: comunicación, coordinación, equilibrio (teoría de juegos), emergencia de comportamiento global.</li>
</ul>
</div>
</div>
<div id="outline-container-org60669cd" class="outline-4">
<h4 id="org60669cd">Sistemas ubicuos (<b>ubicomp</b>)</h4>
<div class="outline-text-4" id="text-org60669cd">
<ul class="org-ul">
<li>Computación <b>integrada</b> en el entorno cotidiano (sensores, wearables, hogar inteligente, ciudades).</li>
<li>Características: invisibilidad, contexto, movilidad, muchos dispositivos heterogéneos.</li>
<li>Relación con IA: agentes distribuidos, percepción contextual, decisiones en tiempo real con recursos limitados.</li>
</ul>

<pre class="example" id="org2e58879">
        ┌─────────────┐
Sensores│   AGENTE    │Actuadores
   ────►│  (programa) │────► Entorno
        └─────────────┘
              ▲
              │ percepción → decisión → acción
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdcb80e7" class="outline-3">
<h3 id="orgdcb80e7">1.8 El papel de la heurística</h3>
<div class="outline-text-3" id="text-orgdcb80e7">
</div>
<div id="outline-container-org2f18260" class="outline-4">
<h4 id="org2f18260">¿Qué es una heurística?</h4>
<div class="outline-text-4" id="text-org2f18260">
<p>
Una <b>heurística</b> es una regla práctica, atajo o función estimadora que <b>guía la búsqueda</b> hacia soluciones prometedoras sin garantizar optimalidad ni completitud en todos los casos.
</p>

<p>
<b>Motivación:</b> el espacio de estados crece exponencialmente (<b>explosión combinatoria</b>). Explorar todo es inviable.
</p>
</div>
</div>
<div id="outline-container-org3bde0e2" class="outline-4">
<h4 id="org3bde0e2">Propiedades deseables</h4>
<div class="outline-text-4" id="text-org3bde0e2">
<ul class="org-ul">
<li><b>Admisibilidad (A</b>):* h(n) nunca sobreestima el costo real → solución óptima si existe.</li>
<li><b>Consistencia (monotonicidad):</b> h(n) ≤ costo(n,n') + h(n') → facilita optimalidad.</li>
<li><b>Información:</b> cuanto más cerca de la realidad, menos nodos se expanden (pero más costosa de calcular).</li>
</ul>
</div>
</div>
<div id="outline-container-org505e359" class="outline-4">
<h4 id="org505e359">Búsqueda ciega vs informada vs local</h4>
<div class="outline-text-4" id="text-org505e359">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo</th>
<th scope="col" class="org-left">Usa costo/heurística</th>
<th scope="col" class="org-left">Ejemplos</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Ciega</td>
<td class="org-left">No (solo estructura)</td>
<td class="org-left">BFS, DFS, costo uniforme</td>
</tr>

<tr>
<td class="org-left">Informada</td>
<td class="org-left">Sí (h)</td>
<td class="org-left">A*, greedy best-first</td>
</tr>

<tr>
<td class="org-left">Local</td>
<td class="org-left">Mejora iterativa</td>
<td class="org-left">Hill climbing, simulated annealing</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org803dfe6" class="outline-3">
<h3 id="org803dfe6">1.8.1 Algoritmos de exploración de alternativas</h3>
<div class="outline-text-3" id="text-org803dfe6">
</div>
<div id="outline-container-orga65be8d" class="outline-4">
<h4 id="orga65be8d">Modelo de problema de búsqueda</h4>
<div class="outline-text-4" id="text-orga65be8d">
<ul class="org-ul">
<li><b>Estado:</b> configuración del mundo.</li>
<li><b>Estado inicial</b> y <b>estados meta</b>.</li>
<li><b>Acciones</b> aplicables y <b>función de transición</b>.</li>
<li><b>Función de costo de camino</b> g(n) (suma de costos desde el inicio).</li>
<li><b>Árbol / grafo de búsqueda:</b> nodos = estados; aristas = acciones.</li>
</ul>
</div>
</div>
<div id="outline-container-orgac52f96" class="outline-4">
<h4 id="orgac52f96">Búsqueda en anchura (BFS)</h4>
<div class="outline-text-4" id="text-orgac52f96">
<ul class="org-ul">
<li>Expande por <b>niveles</b> (frontera FIFO).</li>
<li><b>Completa</b> si el factor de ramificación es finito.</li>
<li><b>Óptima</b> si todos los pasos tienen el mismo costo.</li>
<li><b>Memoria:</b> alta (guarda toda la frontera).</li>
</ul>
</div>
</div>
<div id="outline-container-org0ef00d2" class="outline-4">
<h4 id="org0ef00d2">Búsqueda en profundidad (DFS)</h4>
<div class="outline-text-4" id="text-org0ef00d2">
<ul class="org-ul">
<li>Expande el nodo más profundo primero (pila).</li>
<li><b>Memoria:</b> baja (solo camino actual + frontera).</li>
<li>Riesgo de ciclos → usar conjunto <b>visited</b> o límite de profundidad (IDS).</li>
</ul>
</div>
</div>
<div id="outline-container-org1f39c65" class="outline-4">
<h4 id="org1f39c65">Costo uniforme (UCS / Dijkstra en grafo de estados)</h4>
<div class="outline-text-4" id="text-org1f39c65">
<ul class="org-ul">
<li>Expande el nodo de <b>menor g(n)</b> (cola de prioridad).</li>
<li>Óptima con costos no negativos.</li>
<li>Sin heurística: búsqueda “ciega” informada solo por costos acumulados.</li>
</ul>
</div>
</div>
<div id="outline-container-org4e2ff68" class="outline-4">
<h4 id="org4e2ff68">Greedy best-first</h4>
<div class="outline-text-4" id="text-org4e2ff68">
<ul class="org-ul">
<li>Expande el nodo con menor h(n) (solo heurística).</li>
<li>Rápida pero <b>no garantiza</b> optimalidad ni completitud en todos los grafos.</li>
</ul>
</div>
</div>
