introduccion_inteligencia_artificial.org
*** Ejemplo: laberinto en Python (BFS)

#+begin_src python
from collections import deque

def bfs(start, goal, neighbors):
    """neighbors(state) -> iterable de estados alcanzables."""
    queue = deque([(start, [start])])
    visited = {start}
    while queue:
        state, path = queue.popleft()
        if state == goal:
            return path
        for nxt in neighbors(state):
            if nxt not in visited:
                visited.add(nxt)
                queue.append((nxt, path + [nxt]))
    return None

# Grafo de ejemplo: 0 -- 1 -- 2
#                      \     /
#                        3
graph = {
    0: [1, 3],
    1: [0, 2],
    2: [1, 3],
    3: [0, 2],
}
print("BFS 0→2:", bfs(0, 2, lambda s: graph[s]))
#+end_src

** 1.8.2 Algoritmo A*

*** Idea
A* combina:
- g(n) = costo acumulado desde el inicio.
- h(n) = estimación del costo restante hasta la meta.

*f(n) = g(n) + h(n)*

Expande siempre el nodo con *menor f(n)* en una cola de prioridad.

*** Pseudocódigo (conceptual)
#+begin_example
OPEN ← {nodo_inicial}
g(inicio) ← 0
mientras OPEN no vacío:
    n ← nodo en OPEN con menor f(n) = g(n) + h(n)
    si n es meta: reconstruir camino y terminar
    para cada sucesor n' de n:
        g' ← g(n) + costo(n, n')
        si g' < g(n') o n' no visitado:
            g(n') ← g'
            f(n') ← g' + h(n')
            padre(n') ← n
            añadir n' a OPEN
#+end_example

*** Condiciones para optimalidad
- El grafo es finito o hay criterio de corte.
- h es *admisible* (no sobreestima).
- Con h *consistente*, A* no re-expande innecesariamente.

