index.html
<div id="outline-container-org03cfb1a" class="outline-4">
<h4 id="org03cfb1a">Ejemplo: laberinto en Python (BFS)</h4>
<div class="outline-text-4" id="text-org03cfb1a">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">from</span> collections <span style="color: #fb4934;">import</span> deque

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">bfs</span><span style="color: #fe8019;">(</span>start, goal, neighbors<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""neighbors(state) -&gt; iterable de estados alcanzables."""</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">queue</span> = deque<span style="color: #fe8019;">(</span><span style="color: #b16286;">[</span><span style="color: #b8bb26;">(</span>start, <span style="color: #83a598;">[</span>start<span style="color: #83a598;">]</span><span style="color: #b8bb26;">)</span><span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">visited</span> = <span style="color: #fe8019;">{</span>start<span style="color: #fe8019;">}</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">while</span> queue:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">state</span>, <span style="color: #83a598;">path</span> = queue.popleft<span style="color: #fe8019;">()</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> state == goal:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> path
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> nxt <span style="color: #fb4934;">in</span> neighbors<span style="color: #fe8019;">(</span>state<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> nxt <span style="color: #fb4934;">not</span> <span style="color: #fb4934;">in</span> visited:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   visited.add<span style="color: #fe8019;">(</span>nxt<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   queue.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">(</span>nxt, path + <span style="color: #b8bb26;">[</span>nxt<span style="color: #b8bb26;">]</span><span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #d3869b;">None</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Grafo de ejemplo: 0 -- 1 -- 2
</span><span style="color: #928374;">#                      </span><span style="color: #928374;">\     /
</span><span style="color: #928374;">#                        </span><span style="color: #928374;">3
</span><span style="color: #83a598;">graph</span> = <span style="color: #fe8019;">{</span>
<span style="background-color: #3c3836;"> </span>   0: <span style="color: #b16286;">[</span>1, 3<span style="color: #b16286;">]</span>,
<span style="background-color: #3c3836;"> </span>   1: <span style="color: #b16286;">[</span>0, 2<span style="color: #b16286;">]</span>,
<span style="background-color: #3c3836;"> </span>   2: <span style="color: #b16286;">[</span>1, 3<span style="color: #b16286;">]</span>,
<span style="background-color: #3c3836;"> </span>   3: <span style="color: #b16286;">[</span>0, 2<span style="color: #b16286;">]</span>,
<span style="color: #fe8019;">}</span>
<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"BFS 0&#8594;2:"</span>, bfs<span style="color: #b16286;">(</span>0, 2, <span style="color: #fb4934;">lambda</span> s: graph<span style="color: #b8bb26;">[</span>s<span style="color: #b8bb26;">]</span><span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8abc390" class="outline-3">
<h3 id="org8abc390">1.8.2 Algoritmo A*</h3>
<div class="outline-text-3" id="text-org8abc390">
</div>
<div id="outline-container-org025bd35" class="outline-4">
<h4 id="org025bd35">Idea</h4>
<div class="outline-text-4" id="text-org025bd35">
<p>
A* combina:
</p>
<ul class="org-ul">
<li>g(n) = costo acumulado desde el inicio.</li>
<li>h(n) = estimación del costo restante hasta la meta.</li>
</ul>

<p>
<b>f(n) = g(n) + h(n)</b>
</p>

<p>
Expande siempre el nodo con <b>menor f(n)</b> en una cola de prioridad.
</p>
</div>
</div>
<div id="outline-container-org1af3e29" class="outline-4">
<h4 id="org1af3e29">Pseudocódigo (conceptual)</h4>
<div class="outline-text-4" id="text-org1af3e29">
<pre class="example" id="orge81f2fd">
OPEN ← {nodo_inicial}
g(inicio) ← 0
mientras OPEN no vacío:
    n ← nodo en OPEN con menor f(n) = g(n) + h(n)
    si n es meta: reconstruir camino y terminar
    para cada sucesor n' de n:
        g' ← g(n) + costo(n, n')
        si g' &lt; g(n') o n' no visitado:
            g(n') ← g'
            f(n') ← g' + h(n')
            padre(n') ← n
            añadir n' a OPEN
</pre>
</div>
</div>
<div id="outline-container-org1e7aa96" class="outline-4">
<h4 id="org1e7aa96">Condiciones para optimalidad</h4>
<div class="outline-text-4" id="text-org1e7aa96">
<ul class="org-ul">
<li>El grafo es finito o hay criterio de corte.</li>
<li>h es <b>admisible</b> (no sobreestima).</li>
<li>Con h <b>consistente</b>, A* no re-expande innecesariamente.</li>
</ul>
</div>
</div>
