introduccion_inteligencia_artificial.org
*** Ejemplo: A* en cuadrícula (Manhattan)

#+begin_src python
import heapq

def manhattan(a, b):
    return abs(a[0] - b[0]) + abs(a[1] - b[1])

def astar(start, goal, neighbors, cost=1):
    """
    start, goal: tuplas (fila, col)
    neighbors(pos) -> lista de posiciones válidas
    """
    open_heap = []
    heapq.heappush(open_heap, (manhattan(start, goal), 0, start))
    g_score = {start: 0}
    came_from = {}

    while open_heap:
        f, g, current = heapq.heappop(open_heap)
        if current == goal:
            path = [current]
            while current in came_from:
                current = came_from[current]
                path.append(current)
            return list(reversed(path))

        for nxt in neighbors(current):
            new_g = g_score[current] + cost
            if nxt not in g_score or new_g < g_score[nxt]:
                g_score[nxt] = new_g
                came_from[nxt] = current
                h = manhattan(nxt, goal)
                heapq.heappush(open_heap, (new_g + h, new_g, nxt))
    return None

# Cuadrícula 3x3 sin obstáculos
def grid_neighbors(pos):
    r, c = pos
    moves = []
    for dr, dc in [(-1,0),(1,0),(0,-1),(0,1)]:
        nr, nc = r + dr, c + dc
        if 0 <= nr < 3 and 0 <= nc < 3:
            moves.append((nr, nc))
    return moves

print("A* (0,0)→(2,2):", astar((0,0), (2,2), grid_neighbors))
#+end_src

*** Cuándo usar A*
- Mapas, planificación de rutas, puzzles con costo en aristas.
- Cuando existe una h admisible razonable (distancia euclidiana, Manhattan, patrón desajustado en 8-puzzle).

** 1.8.3 Algoritmos de búsqueda local

*** Idea
En lugar de explorar sistemáticamente todo un árbol, la *búsqueda local* parte de una *solución candidato* y la va *mejorando* iterativamente según una *función objetivo* (o energía).

Útil cuando:
- El camino importa menos que el *estado final* (optimización, CSP relajados).
- El espacio es enorme pero hay estructura local.

*** Hill climbing (escalada de colina)
1. Estado actual s.
2. Evaluar vecinos; moverse al vecino con *mejor* valor.
3. Parar si no hay mejora (máximo local).

*Problema:* máximos locales, mesetas, crestas.

*** Variantes
| Algoritmo              | Idea                                           |
|------------------------+------------------------------------------------|
| Steepest ascent        | Mejor vecino en cada paso                      |
| Stochastic hill climb  | Elige aleatoriamente entre mejoras             |
| Random restart         | Reinicia desde puntos aleatorios               |
| Simulated annealing    | Acepta empeoras con probabilidad decreciente   |
| Genetic algorithms     | Población, cruce, mutación, selección          |

