index.html
<div id="outline-container-orgd436111" class="outline-4">
<h4 id="orgd436111">Ejemplo: A* en cuadrícula (Manhattan)</h4>
<div class="outline-text-4" id="text-orgd436111">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> heapq

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">manhattan</span><span style="color: #fe8019;">(</span>a, b<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #fe8019;">abs</span><span style="color: #fe8019;">(</span>a<span style="color: #b16286;">[</span>0<span style="color: #b16286;">]</span> - b<span style="color: #b16286;">[</span>0<span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span> + <span style="color: #fe8019;">abs</span><span style="color: #fe8019;">(</span>a<span style="color: #b16286;">[</span>1<span style="color: #b16286;">]</span> - b<span style="color: #b16286;">[</span>1<span style="color: #b16286;">]</span><span style="color: #fe8019;">)</span>

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">astar</span><span style="color: #fe8019;">(</span>start, goal, neighbors, cost=1<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #dfd2b8;">"""
</span><span style="color: #dfd2b8; background-color: #3c3836;"> </span><span style="color: #dfd2b8;">   start, goal: tuplas (fila, col)
</span><span style="color: #dfd2b8; background-color: #3c3836;"> </span><span style="color: #dfd2b8;">   neighbors(pos) -&gt; lista de posiciones v&#225;lidas
</span><span style="color: #dfd2b8; background-color: #3c3836;"> </span><span style="color: #dfd2b8;">   """</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">open_heap</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   heapq.heappush<span style="color: #fe8019;">(</span>open_heap, <span style="color: #b16286;">(</span>manhattan<span style="color: #b8bb26;">(</span>start, goal<span style="color: #b8bb26;">)</span>, 0, start<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">g_score</span> = <span style="color: #fe8019;">{</span>start: 0<span style="color: #fe8019;">}</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">came_from</span> = <span style="color: #fe8019;">{}</span>

<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">while</span> open_heap:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">f</span>, <span style="color: #83a598;">g</span>, <span style="color: #83a598;">current</span> = heapq.heappop<span style="color: #fe8019;">(</span>open_heap<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> current == goal:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">path</span> = <span style="color: #fe8019;">[</span>current<span style="color: #fe8019;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">while</span> current <span style="color: #fb4934;">in</span> came_from:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">current</span> = came_from<span style="color: #fe8019;">[</span>current<span style="color: #fe8019;">]</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   path.append<span style="color: #fe8019;">(</span>current<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #fe8019;">list</span><span style="color: #fe8019;">(</span><span style="color: #fe8019;">reversed</span><span style="color: #b16286;">(</span>path<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>

<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> nxt <span style="color: #fb4934;">in</span> neighbors<span style="color: #fe8019;">(</span>current<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">new_g</span> = g_score<span style="color: #fe8019;">[</span>current<span style="color: #fe8019;">]</span> + cost
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> nxt <span style="color: #fb4934;">not</span> <span style="color: #fb4934;">in</span> g_score <span style="color: #fb4934;">or</span> new_g &lt; g_score<span style="color: #fe8019;">[</span>nxt<span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">g_score</span><span style="color: #fe8019;">[</span>nxt<span style="color: #fe8019;">]</span> = new_g
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">came_from</span><span style="color: #fe8019;">[</span>nxt<span style="color: #fe8019;">]</span> = current
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">h</span> = manhattan<span style="color: #fe8019;">(</span>nxt, goal<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   heapq.heappush<span style="color: #fe8019;">(</span>open_heap, <span style="color: #b16286;">(</span>new_g + h, new_g, nxt<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> <span style="color: #d3869b;">None</span>

<span style="color: #928374;"># </span><span style="color: #928374;">Cuadr&#237;cula 3x3 sin obst&#225;culos
</span><span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">grid_neighbors</span><span style="color: #fe8019;">(</span>pos<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">r</span>, <span style="color: #83a598;">c</span> = pos
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">moves</span> = <span style="color: #fe8019;">[]</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> dr, dc <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">[</span><span style="color: #b16286;">(</span>-1,0<span style="color: #b16286;">)</span>,<span style="color: #b16286;">(</span>1,0<span style="color: #b16286;">)</span>,<span style="color: #b16286;">(</span>0,-1<span style="color: #b16286;">)</span>,<span style="color: #b16286;">(</span>0,1<span style="color: #b16286;">)</span><span style="color: #fe8019;">]</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">nr</span>, <span style="color: #83a598;">nc</span> = r + dr, c + dc
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> 0 &lt;= nr &lt; 3 <span style="color: #fb4934;">and</span> 0 &lt;= nc &lt; 3:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   moves.append<span style="color: #fe8019;">(</span><span style="color: #b16286;">(</span>nr, nc<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> moves

<span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span><span style="color: #b8bb26;">"A* (0,0)&#8594;(2,2):"</span>, astar<span style="color: #b16286;">(</span><span style="color: #b8bb26;">(</span>0,0<span style="color: #b8bb26;">)</span>, <span style="color: #b8bb26;">(</span>2,2<span style="color: #b8bb26;">)</span>, grid_neighbors<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org30d3be0" class="outline-4">
<h4 id="org30d3be0">Cuándo usar A*</h4>
<div class="outline-text-4" id="text-org30d3be0">
<ul class="org-ul">
<li>Mapas, planificación de rutas, puzzles con costo en aristas.</li>
<li>Cuando existe una h admisible razonable (distancia euclidiana, Manhattan, patrón desajustado en 8-puzzle).</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga7fb474" class="outline-3">
<h3 id="orga7fb474">1.8.3 Algoritmos de búsqueda local</h3>
<div class="outline-text-3" id="text-orga7fb474">
</div>
<div id="outline-container-org2723481" class="outline-4">
<h4 id="org2723481">Idea</h4>
<div class="outline-text-4" id="text-org2723481">
<p>
En lugar de explorar sistemáticamente todo un árbol, la <b>búsqueda local</b> parte de una <b>solución candidato</b> y la va <b>mejorando</b> iterativamente según una <b>función objetivo</b> (o energía).
</p>

<p>
Útil cuando:
</p>
<ul class="org-ul">
<li>El camino importa menos que el <b>estado final</b> (optimización, CSP relajados).</li>
<li>El espacio es enorme pero hay estructura local.</li>
</ul>
</div>
</div>
<div id="outline-container-org976d029" class="outline-4">
<h4 id="org976d029">Hill climbing (escalada de colina)</h4>
<div class="outline-text-4" id="text-org976d029">
<ol class="org-ol">
<li>Estado actual s.</li>
<li>Evaluar vecinos; moverse al vecino con <b>mejor</b> valor.</li>
<li>Parar si no hay mejora (máximo local).</li>
</ol>

<p>
<b>Problema:</b> máximos locales, mesetas, crestas.
</p>
</div>
</div>
<div id="outline-container-org41c7687" class="outline-4">
<h4 id="org41c7687">Variantes</h4>
<div class="outline-text-4" id="text-org41c7687">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Algoritmo</th>
<th scope="col" class="org-left">Idea</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Steepest ascent</td>
<td class="org-left">Mejor vecino en cada paso</td>
</tr>

<tr>
<td class="org-left">Stochastic hill climb</td>
<td class="org-left">Elige aleatoriamente entre mejoras</td>
</tr>

<tr>
<td class="org-left">Random restart</td>
<td class="org-left">Reinicia desde puntos aleatorios</td>
</tr>

<tr>
<td class="org-left">Simulated annealing</td>
<td class="org-left">Acepta empeoras con probabilidad decreciente</td>
</tr>

<tr>
<td class="org-left">Genetic algorithms</td>
<td class="org-left">Población, cruce, mutación, selección</td>
</tr>
</tbody>
</table>
</div>
</div>
