introduccion_inteligencia_artificial.org
*** Ejemplo: hill climbing (maximizar función 1D discreta)

#+begin_src python
import random

def hill_climbing(f, start, neighbors, max_steps=100):
    current = start
    value = f(current)
    for _ in range(max_steps):
        nbrs = list(neighbors(current))
        if not nbrs:
            break
        best = max(nbrs, key=f)
        best_val = f(best)
        if best_val <= value:
            break  # máximo local
        current, value = best, best_val
    return current, value

# Función con máximo local en x=2 y global en x=8 (dominio 0..10)
def f(x):
    return -(x - 8) ** 2 + 64 if x >= 5 else -(x - 2) ** 2 + 10

def nbrs(x):
  for d in (-1, 1):
      if 0 <= x + d <= 10:
          yield x + d

for trial in range(3):
    s0 = random.randint(0, 10)
    s, v = hill_climbing(f, s0, nbrs)
    print(f"inicio={s0} → máximo local en x={s}, f={v}")
#+end_src

*** Búsqueda local vs A*
| Criterio        | A* (sistemática)     | Búsqueda local        |
|-----------------+----------------------+-----------------------|
| Garantía óptima | Sí (con h admisible) | No en general         |
| Memoria         | Puede ser alta       | Baja (un estado)      |
| Uso típico      | Camino mínimo        | Optimización, scheduling |

** Síntesis del temario

| Subtema | Idea central                                              |
|---------+-----------------------------------------------------------|
| 1.1     | IA = sistemas que perciben, razonan, aprenden y actúan  |
| 1.2     | Ciclos de optimismo e invierno; datos y deep learning     |
| 1.3     | Cognición humana; Gardner, conductismo → RL               |
| 1.4     | Axiomas, teoremas, demostración; lógica en IA simbólica   |
| 1.5     | Origen y representación del conocimiento                  |
| 1.6     | Arquitecturas que modelan procesos mentales               |
| 1.7     | Agente racional; SMA; computación ubicua                  |
| 1.8     | Heurísticas; BFS/DFS/UCS; A*; búsqueda local              |

** Referencias sugeridas
- Russell, S. & Norvig, P. *Artificial Intelligence: A Modern Approach* (capítulos 1–4).
- Turing, A. (1950). Computing Machinery and Intelligence.
- Gardner, H. *Frames of Mind* (inteligencias múltiples).
- Newell, A. *Unified Theories of Cognition* (SOAR / ACT-R en contexto).

** Preguntas de repaso
1. ¿En qué se diferencia un agente *reflejo* de uno *basado en objetivos*?
2. ¿Por qué A* necesita que h sea admisible para garantizar optimalidad?
3. ¿Qué paralelo existe entre el conductismo y el aprendizaje por refuerzo?
4. ¿Cuál es la diferencia entre *conocimiento* codificado manualmente y *aprendido*?
5. ¿Por qué hill climbing puede fallar en optimización global?

#+RESULTS:
: None


 
* Acertijos de IA: espacio de estados, lógica y poda

Estos acertijos se resuelven como *problemas de búsqueda* en un *espacio
de estados*, pero **no hace falta expandir el espacio completo**: las
restricciones lógicas *podan* ramas inválidas o subóptimas desde el
inicio.

| Acertijo              | Idea de estado                          | Por qué no explotar todo ciegamente        |
|-----------------------+-----------------------------------------+--------------------------------------------|
| Maridos celosos       | quién está en cada orilla + bote        | Regla de “celos” invalida muchos sucesores |
| Puente y linterna     | quién cruzó + lado de linterna + tiempo | Poda por tiempo > 17 o dominancia          |
| Flavio Josefo         | círculo + contador de eliminación       | Simulación O(n²) o fórmula O(log n)        |

*Herramientas:* representación lógica, invariantes, búsqueda con poda (BFS acotado), razonamiento guiado.

** 1. El problema de los maridos celosos

*** Enunciado
Tres parejas (tres maridos y sus tres esposas) deben cruzar un río usando un bote con capacidad máxima para *dos personas*.

*Restricción:* ninguna mujer puede quedarse en presencia de *otro* hombre a menos que su *propio marido* también esté presente (en orillas y en el bote).

*Objetivo:* secuencia de viajes *mínima* para que las seis personas crucen sin violar la restricción.

*** Modelado del espacio de estados (sin enumerar todo a ciegas)

