index.html
<div id="outline-container-org486f19c" class="outline-4">
<h4 id="org486f19c">Ejemplo: hill climbing (maximizar función 1D discreta)</h4>
<div class="outline-text-4" id="text-org486f19c">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #fb4934;">import</span> random

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">hill_climbing</span><span style="color: #fe8019;">(</span>f, start, neighbors, max_steps=100<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">current</span> = start
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">value</span> = f<span style="color: #fe8019;">(</span>current<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">for</span> _ <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">range</span><span style="color: #fe8019;">(</span>max_steps<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">nbrs</span> = <span style="color: #fe8019;">list</span><span style="color: #fe8019;">(</span>neighbors<span style="color: #b16286;">(</span>current<span style="color: #b16286;">)</span><span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> <span style="color: #fb4934;">not</span> nbrs:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">break</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">best</span> = <span style="color: #fe8019;">max</span><span style="color: #fe8019;">(</span>nbrs, key=f<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">best_val</span> = f<span style="color: #fe8019;">(</span>best<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">if</span> best_val &lt;= value:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">break</span>  <span style="color: #928374;"># </span><span style="color: #928374;">m&#225;ximo local
</span><span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">current</span>, <span style="color: #83a598;">value</span> = best, best_val
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> current, value

<span style="color: #928374;"># </span><span style="color: #928374;">Funci&#243;n con m&#225;ximo local en x=2 y global en x=8 (dominio 0..10)
</span><span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">f</span><span style="color: #fe8019;">(</span>x<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #fb4934;">return</span> -<span style="color: #fe8019;">(</span>x - 8<span style="color: #fe8019;">)</span> ** 2 + 64 <span style="color: #fb4934;">if</span> x &gt;= 5 <span style="color: #fb4934;">else</span> -<span style="color: #fe8019;">(</span>x - 2<span style="color: #fe8019;">)</span> ** 2 + 10

<span style="color: #fb4934;">def</span> <span style="color: #b8bb26;">nbrs</span><span style="color: #fe8019;">(</span>x<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span> <span style="color: #fb4934;">for</span> d <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">(</span>-1, 1<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span> <span style="color: #fb4934;">if</span> 0 &lt;= x + d &lt;= 10:
<span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span>   <span style="background-color: #3c3836;"> </span> <span style="color: #fb4934;">yield</span> x + d

<span style="color: #fb4934;">for</span> trial <span style="color: #fb4934;">in</span> <span style="color: #fe8019;">range</span><span style="color: #fe8019;">(</span>3<span style="color: #fe8019;">)</span>:
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">s0</span> = random.randint<span style="color: #fe8019;">(</span>0, 10<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #83a598;">s</span>, <span style="color: #83a598;">v</span> = hill_climbing<span style="color: #fe8019;">(</span>f, s0, nbrs<span style="color: #fe8019;">)</span>
<span style="background-color: #3c3836;"> </span>   <span style="color: #fe8019;">print</span><span style="color: #fe8019;">(</span>f<span style="color: #b8bb26;">"inicio=</span>{s0}<span style="color: #b8bb26;"> &#8594; m&#225;ximo local en x=</span>{s}<span style="color: #b8bb26;">, f=</span>{v}<span style="color: #b8bb26;">"</span><span style="color: #fe8019;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org533139f" class="outline-4">
<h4 id="org533139f">Búsqueda local vs A*</h4>
<div class="outline-text-4" id="text-org533139f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Criterio</th>
<th scope="col" class="org-left">A* (sistemática)</th>
<th scope="col" class="org-left">Búsqueda local</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Garantía óptima</td>
<td class="org-left">Sí (con h admisible)</td>
<td class="org-left">No en general</td>
</tr>

<tr>
<td class="org-left">Memoria</td>
<td class="org-left">Puede ser alta</td>
<td class="org-left">Baja (un estado)</td>
</tr>

<tr>
<td class="org-left">Uso típico</td>
<td class="org-left">Camino mínimo</td>
<td class="org-left">Optimización, scheduling</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org96d6f5c" class="outline-3">
<h3 id="org96d6f5c">Síntesis del temario</h3>
<div class="outline-text-3" id="text-org96d6f5c">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Subtema</th>
<th scope="col" class="org-left">Idea central</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1.1</td>
<td class="org-left">IA = sistemas que perciben, razonan, aprenden y actúan</td>
</tr>

<tr>
<td class="org-right">1.2</td>
<td class="org-left">Ciclos de optimismo e invierno; datos y deep learning</td>
</tr>

<tr>
<td class="org-right">1.3</td>
<td class="org-left">Cognición humana; Gardner, conductismo → RL</td>
</tr>

<tr>
<td class="org-right">1.4</td>
<td class="org-left">Axiomas, teoremas, demostración; lógica en IA simbólica</td>
</tr>

<tr>
<td class="org-right">1.5</td>
<td class="org-left">Origen y representación del conocimiento</td>
</tr>

<tr>
<td class="org-right">1.6</td>
<td class="org-left">Arquitecturas que modelan procesos mentales</td>
</tr>

<tr>
<td class="org-right">1.7</td>
<td class="org-left">Agente racional; SMA; computación ubicua</td>
</tr>

<tr>
<td class="org-right">1.8</td>
<td class="org-left">Heurísticas; BFS/DFS/UCS; A*; búsqueda local</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8f8ef16" class="outline-3">
<h3 id="org8f8ef16">Referencias sugeridas</h3>
<div class="outline-text-3" id="text-org8f8ef16">
<ul class="org-ul">
<li>Russell, S. &amp; Norvig, P. <b>Artificial Intelligence: A Modern Approach</b> (capítulos 1–4).</li>
<li>Turing, A. (1950). Computing Machinery and Intelligence.</li>
<li>Gardner, H. <b>Frames of Mind</b> (inteligencias múltiples).</li>
<li>Newell, A. <b>Unified Theories of Cognition</b> (SOAR / ACT-R en contexto).</li>
</ul>
</div>
</div>
<div id="outline-container-orgc7fffc6" class="outline-3">
<h3 id="orgc7fffc6">Preguntas de repaso</h3>
<div class="outline-text-3" id="text-orgc7fffc6">
<ol class="org-ol">
<li>¿En qué se diferencia un agente <b>reflejo</b> de uno <b>basado en objetivos</b>?</li>
<li>¿Por qué A* necesita que h sea admisible para garantizar optimalidad?</li>
<li>¿Qué paralelo existe entre el conductismo y el aprendizaje por refuerzo?</li>
<li>¿Cuál es la diferencia entre <b>conocimiento</b> codificado manualmente y <b>aprendido</b>?</li>
<li>¿Por qué hill climbing puede fallar en optimización global?</li>
</ol>

<pre class="example">
None
</pre>
</div>
</div>
</div>
<div id="outline-container-org787b17f" class="outline-2">
<h2 id="org787b17f">Acertijos de IA: espacio de estados, lógica y poda</h2>
<div class="outline-text-2" id="text-org787b17f">
<p>
Estos acertijos se resuelven como <b>problemas de búsqueda</b> en un <b>espacio
de estados</b>, pero <b><b>no hace falta expandir el espacio completo</b></b>: las
restricciones lógicas <b>podan</b> ramas inválidas o subóptimas desde el
inicio.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Acertijo</th>
<th scope="col" class="org-left">Idea de estado</th>
<th scope="col" class="org-left">Por qué no explotar todo ciegamente</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Maridos celosos</td>
<td class="org-left">quién está en cada orilla + bote</td>
<td class="org-left">Regla de “celos” invalida muchos sucesores</td>
</tr>

<tr>
<td class="org-left">Puente y linterna</td>
<td class="org-left">quién cruzó + lado de linterna + tiempo</td>
<td class="org-left">Poda por tiempo &gt; 17 o dominancia</td>
</tr>

<tr>
<td class="org-left">Flavio Josefo</td>
<td class="org-left">círculo + contador de eliminación</td>
<td class="org-left">Simulación O(n²) o fórmula O(log n)</td>
</tr>
</tbody>
</table>

<p>
<b>Herramientas:</b> representación lógica, invariantes, búsqueda con poda (BFS acotado), razonamiento guiado.
</p>
</div>
<div id="outline-container-org623dc44" class="outline-3">
<h3 id="org623dc44">1. El problema de los maridos celosos</h3>
<div class="outline-text-3" id="text-org623dc44">
</div>
<div id="outline-container-orgbb7534c" class="outline-4">
<h4 id="orgbb7534c">Enunciado</h4>
<div class="outline-text-4" id="text-orgbb7534c">
<p>
Tres parejas (tres maridos y sus tres esposas) deben cruzar un río usando un bote con capacidad máxima para <b>dos personas</b>.
</p>

<p>
<b>Restricción:</b> ninguna mujer puede quedarse en presencia de <b>otro</b> hombre a menos que su <b>propio marido</b> también esté presente (en orillas y en el bote).
</p>

<p>
<b>Objetivo:</b> secuencia de viajes <b>mínima</b> para que las seis personas crucen sin violar la restricción.
</p>
</div>
</div>
<div id="outline-container-orgcd191f2" class="outline-4">
<h4 id="orgcd191f2">Modelado del espacio de estados (sin enumerar todo a ciegas)</h4>
<div class="outline-text-4" id="text-orgcd191f2">
</div>
<ul class="org-ul">
