index.html
<li><a id="org648350f"></a>Variables<br />
<div class="outline-text-5" id="text-org648350f">
<ul class="org-ul">
<li>Conjunto <code>L</code> (orilla izquierda) y <code>R</code> (orilla derecha), con <code>L ⊔ R = {H1,W1,H2,W2,H3,W3}</code>.</li>
<li>Posición del bote: <code>bote ∈ {izquierda, derecha}</code>.</li>
<li><b>Estado:</b> <code>(personas_en_R, bote_izquierda)</code> (equivalente a saber quién está en cada lado).</li>
</ul>
</div>
</li>
<li><a id="org43f2dd5"></a>Acciones<br />
<div class="outline-text-5" id="text-org43f2dd5">
<p>
Desde la orilla donde está el bote, elegir 1 o 2 personas que cruzan.
</p>
</div>
</li>
<li><a id="org586ed96"></a>Predicado lógico de seguridad (poda)<br />
<div class="outline-text-5" id="text-org586ed96">
<p>
Para cada orilla <code>X</code>:
</p>

<pre class="example" id="orgf27f74b">
segura(X) ≡ ∀ mujer Wi ∈ X, ∀ hombre Hj ∈ X con j≠i:
              (Hj ∈ X) → (Hi ∈ X)

Si Wi está con un hombre que NO es su marido, su marido Hi también debe estar en X.
</pre>

<p>
<b>Poda:</b> solo se expanden sucesores con <code>segura(L) ∧ segura(R)</code>.
</p>
</div>
</li>
<li><a id="org15204ff"></a>Tamaño del espacio<br />
<div class="outline-text-5" id="text-org15204ff">
<ul class="org-ul">
<li>Bruto: <code>2^6 × 2 = 128</code> estados.</li>
<li>Con poda lógica: el BFS explora ~*40* estados (orden de magnitud), no un árbol exponencial de secuencias de movimientos.</li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orgba5a81c" class="outline-4">
<h4 id="orgba5a81c">Razonamiento guiado (lógica antes que fuerza bruta)</h4>
<div class="outline-text-4" id="text-orgba5a81c">
<ol class="org-ol">
<li><b>Mover dos esposas primero</b> es seguro (no hay hombres en la orilla de llegada).</li>
<li><b>Regresar una esposa</b> devuelve el bote sin dejar a una mujer con hombres ajenos sin su marido.</li>
<li><b>Dos maridos</b> pueden cruzar cuando en la otra orilla sus esposas ya están o la composición es segura.</li>
<li>La tercera pareja (<code>H3,W3</code>) cruza cuando el tablero lo permite.</li>
<li>Los últimos viajes reacomodan a quien debe regresar con el bote.</li>
</ol>
</div>
</div>
<div id="outline-container-org5255b9e" class="outline-4">
<h4 id="org5255b9e">Solución óptima: <b>9 viajes</b></h4>
<div class="outline-text-4" id="text-org5255b9e">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Paso</th>
<th scope="col" class="org-left">Viaje</th>
<th scope="col" class="org-left">Izquierda (L)</th>
<th scope="col" class="org-left">Derecha (R)</th>
<th scope="col" class="org-left">Bote</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">—</td>
<td class="org-left">H1 W1 H2 W2 H3 W3</td>
<td class="org-left">—</td>
<td class="org-left">L</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">W1, W2 →</td>
<td class="org-left">H1 H2 H3 W3</td>
<td class="org-left">W1 W2</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">W1 ←</td>
<td class="org-left">H1 W1 H2 H3 W3</td>
<td class="org-left">W2</td>
<td class="org-left">L</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">H1, H2 →</td>
<td class="org-left">H3 W3</td>
<td class="org-left">H1 H2 W1 W2</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">H1, W1 ←</td>
<td class="org-left">H1 W1 H3 W3</td>
<td class="org-left">H2 W2</td>
<td class="org-left">L</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">H3, W3 →</td>
<td class="org-left">H1 W1</td>
<td class="org-left">H2 W2 H3 W3</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">H2, W2 ←</td>
<td class="org-left">H1 W1 H2 W2</td>
<td class="org-left">H3 W3</td>
<td class="org-left">L</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">H1, H2 →</td>
<td class="org-left">W1 W2</td>
<td class="org-left">H1 H2 H3 W3</td>
<td class="org-left">R</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">H1, W1 ←</td>
<td class="org-left">H1 W1</td>
<td class="org-left">H2 W2 H3 W3</td>
<td class="org-left">L</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">H1, W1 →</td>
<td class="org-left">—</td>
<td class="org-left">H1 W1 H2 W2 H3 W3</td>
<td class="org-left">R ✓</td>
</tr>
</tbody>
</table>

<p>
<b>Paso crítico 7:</b> en R están <code>H1,H2,H3,W3</code>. <code>W3</code> convive con <code>H1</code> y <code>H2</code> porque su marido <code>H3</code> también está → <b>válido</b>.
</p>
</div>
</div>
</div>
<div id="outline-container-org3b02efd" class="outline-3">
<h3 id="org3b02efd">2. El puente y la linterna (optimización en 17 minutos)</h3>
<div class="outline-text-3" id="text-org3b02efd">
</div>
<div id="outline-container-org17afd6f" class="outline-4">
<h4 id="org17afd6f">Enunciado</h4>
<div class="outline-text-4" id="text-org17afd6f">
<p>
Cuatro personas deben cruzar un puente de noche. El puente soporta <b>dos</b> personas. Hay <b>una</b> linterna.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Persona</th>
<th scope="col" class="org-left">Tiempo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">1 min</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">2 min</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">5 min</td>
</tr>

<tr>
<td class="org-left">D</td>
<td class="org-left">10 min</td>
</tr>
</tbody>
</table>

<p>
Dos personas cruzan a la velocidad de la <b>más lenta</b>. La linterna debe volver para el siguiente cruce.
</p>

<p>
<b>Objetivo:</b> todos al otro lado en exactamente <b>17 minutos</b>.
</p>
</div>
</div>
<div id="outline-container-org8985ff5" class="outline-4">
<h4 id="org8985ff5">Modelado (estado acotado)</h4>
<div class="outline-text-4" id="text-org8985ff5">
</div>
<ul class="org-ul">
<li><a id="orga277e34"></a>Estado <code>(C, ℓ, t)</code><br />
<div class="outline-text-5" id="text-orga277e34">
<ul class="org-ul">
<li><code>C ⊆ {A,B,C,D}</code>: quienes ya cruzaron.</li>
<li><code>ℓ</code>: linterna en lado <b>cerca</b> o <b>lejos</b>.</li>
<li><code>t</code>: tiempo acumulado (minutos).</li>
</ul>
</div>
</li>
<li><a id="org2016f59"></a>Poda (evita explosión)<br />
<div class="outline-text-5" id="text-org2016f59">
<ol class="org-ol">
<li>Si <code>t &gt; 17</code> → <b>cortar rama</b>.</li>
<li><b>Dominancia:</b> para igual <code>(C, ℓ)</code>, quedarse solo con el camino de menor <code>t</code>.</li>
<li>Espacio total acotado: ≈ 16 × 2 × 18 estados (minúsculo frente a enumerar todas las secuencias de pares).</li>
</ol>
</div>
</li>
</ul>
</div>
<div id="outline-container-org106bccd" class="outline-4">
<h4 id="org106bccd">Razonamiento lógico (sin BFS)</h4>
<div class="outline-text-4" id="text-org106bccd">
<p>
<b>Lema informal:</b> los lentos <code>C</code> y <code>D</code> deben cruzar juntos <b>como máximo una vez</b> en la solución óptima (cuesta 10 min). Si cada uno cruzara por separado con escolta, se pagan más de 10 min solo en esos cruces.
</p>

<p>
<b>Estrategia ganadora:</b>
</p>
<ol class="org-ol">
<li>Mandar primero los dos rápidos (<code>A+B</code>, 2 min).</li>
<li>Devolver el <b>más rápido</b> (<code>A</code>, 1 min).</li>
<li>Cruzar los dos lentos juntos (<code>C+D</code>, 10 min) — el gasto inevitable.</li>
<li>Devolver alguien moderado (<code>B</code>, 2 min) — mejor que dos vueltas de <code>A</code> si eso habilita el cierre.</li>
<li>Cerrar con <code>A+B</code> (2 min).</li>
</ol>

<p>
Total: 2+1+10+2+2 = <b>17</b>.
</p>
</div>
</div>
<div id="outline-container-org7b8f757" class="outline-4">
<h4 id="org7b8f757">Solución paso a paso</h4>
<div class="outline-text-4" id="text-org7b8f757">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Paso</th>
<th scope="col" class="org-left">Acción</th>
<th scope="col" class="org-right">Δt</th>
<th scope="col" class="org-right">Acumulado</th>
<th scope="col" class="org-left">En lado lejano</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">A + B →</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-left">A, B</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">A ←</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-left">B</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">C + D →</td>
<td class="org-right">10</td>
<td class="org-right">13</td>
<td class="org-left">B, C, D</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">B ←</td>
<td class="org-right">2</td>
<td class="org-right">15</td>
<td class="org-left">C, D</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">A + B →</td>
<td class="org-right">2</td>
<td class="org-right"><b>17</b></td>
<td class="org-left">A, B, C, D ✓</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orged7471a" class="outline-3">
<h3 id="orged7471a">3. Flavio Josefo y el círculo de la muerte</h3>
<div class="outline-text-3" id="text-orged7471a">
</div>
<div id="outline-container-orgdc38775" class="outline-4">
<h4 id="orgdc38775">Historia</h4>
<div class="outline-text-4" id="text-orgdc38775">
<p>
<b>Flavio Josefo</b> relata que, sitiado en Yodfat con 40 compañeros (41 hombres en total), convinieron en morir por sorteo circular antes que rendirse. Josefo calculó la posición segura y sobrevivió — de ahí el <b>problema de Josefo</b>.
</p>
</div>
</div>
<div id="outline-container-orga9e4c77" class="outline-4">
<h4 id="orga9e4c77">Enunciado matemático</h4>
<div class="outline-text-4" id="text-orga9e4c77">
<ul class="org-ul">
<li><code>n</code> personas en círculo, numeradas <code>1 … n</code>.</li>
<li>Se cuenta en círculo y se elimina cada <code>k</code>-ésima persona <b>viva</b>.</li>
<li>Se repite hasta quedar <b>una</b>.</li>
<li><b>¿Qué posición inicial garantiza sobrevivir?</b> <code>J(n, k)</code>.</li>
</ul>
</div>
</div>
