introduccion_inteligencia_artificial.org
*** ¿Por qué no expandir el árbol completo?
Un árbol de “quién se elimina en cada ronda” tiene ramificación variable y profundidad =n-1=; para =n= grande es innecesario.

| Enfoque              | Complejidad | Cuándo usarlo              |
|----------------------+-------------+----------------------------|
| Simulación en lista  | O(n²)       | Cualquier =k=, =n= moderado |
| Recurrencia          | O(n)        | Programación dinámica      |
| Fórmula cerrada k=2  | O(log n)    | “Cada segundo” (clásico)   |

*** Caso k = 2 (eliminar cada segundo)

**** Fórmula cerrada
Sea =m = ⌊log₂ n⌋= y =2^m ≤ n < 2^(m+1)=:

\[ J(n, 2) = 2 \cdot (n - 2^m) + 1 \]

**** Intuición
Cada ronda con =k=2= elimina la mitad (aprox.) de los vivos; la posición sobreviviente se obtiene “reflejando” el índice respecto a la mayor potencia de 2 ≤ =n=.

**** Historia: n = 41 soldados
- =2^5 = 32 ≤ 41 < 64= → =m = 5=.
- =J(41, 2) = 2·(41 - 32) + 1 = 19=.

*Josefo debía situarse en la posición 19* (contando desde 1) si el sorteo eliminaba cada segundo.

*** Ejemplo manual: n = 7, k = 2

Con la convención estándar (=J(1,2)=1=, =J(2n)=2J(n)-1=, =J(2n+1)=2J(n)+1=):

#+begin_example
J(1)=1, J(2)=1, J(3)=3, J(4)=1, J(5)=3, J(6)=5, J(7)=7
#+end_example

Fórmula potencias de 2: =2·(7-4)+1 = 7=. La posición segura es la *7* (contando desde 1).

*** Caso general k (algoritmo iterativo O(n))

#+begin_example
J ← 0
para i = 1 … n:
    J ← (J + k) mod i
respuesta (1-indexada) = J + 1
#+end_example

Este algoritmo evita simular el círculo completo (=O(n²)=) y coincide con la fórmula cerrada cuando =k=2=.


*** Síntesis: lógica vs explosión combinatoria

| Problema        | Truco principal                          | Viajes / respuesta      |
|-----------------+------------------------------------------+-------------------------|
| Maridos celosos | Predicado =segura(orilla)= poda BFS      | *9* viajes mínimos      |
| Puente          | C+D juntos una vez; poda =t>17=          | *17* minutos            |
| Josefo (k=2)    | Fórmula con potencias de 2; O(n) rec.    | =J(41,2)=*19*           |

*** Preguntas de repaso
1. ¿Qué estado del problema de maridos celosos es inválido aunque el bote tenga capacidad 2?
2. ¿Por qué mandar =A= dos veces de vuelta no mejora necesariamente el puente frente a devolver =B= una vez?
3. ¿Cuál es =J(12, 2)=? (=2·(12-8)+1 = 9=)
4. ¿En qué caso conviene simular Josefo en lugar de usar recurrencia?

*Referencias*
- Russell & Norvig, cap. 3 (búsqueda en espacios de estados).
- Klein, T. (puzzle del puente y linterna) — optimización clásica.
- Josephus Flavius, *La guerra de los judíos* (fuente histórica).

#+RESULTS:
: None



*  A*  — Arriero, coyote, cabra y maíz


** Símbolos 
| Símbolo | Personaje            |
|---------+----------------------|
| A       | Arriero              |
| L       | Coyote (lobo)        |
| C       | Cabra (chivo, pollo) |
| M       | Maíz                 |

** Reglas del bote
- Viajan el arriero y *como máximo uno* más.
- Sin arriero, *nunca* pueden quedar solos en una orilla:
  - Coyote + cabra
  - Cabra + maíz

** Objetivo
Que los cuatro terminen en la *orilla derecha*.

** Parte 1 — ¿Qué es un estado? (la “fotografía” del río)

En cada momento anotas *tres cosas*:

#+begin_example
[ Quién está a la IZQUIERDA | Quién está a la DERECHA ]   BOTE

Ejemplo inicio:
  [ A L C M | — ]   Bote en izquierda ◄

Ejemplo meta:
  [ — | A L C M ]   Bote en derecha ►
#+end_example

Cada vez que el bote cruza, cambias de fotografía → eso es moverte en el *espacio de estados*.

** Parte 2 — El espacio de estados (el mapa completo del camino bueno)

*** Los 8 estados del camino más corto (7 cruces)

Usamos códigos E0, E1, … E* para no repetir dibujos.

| Código | Izquierda | Derecha | Bote | Qué acaba de pasar |
|--------+-----------+---------+------+--------------------|
| E0     | A L C M   | —       | ◄    | (inicio)           |
| E1     | L M       | A C     | ►    | A+C cruzan →       |
| E2     | A L M     | C       | ◄    | A regresa ←        |
| E3     | M         | A L C   | ►    | A+L cruzan →       |
| E4     | A C M     | L       | ◄    | A+C regresan ←     |
| E5     | C         | A L M   | ►    | A+M cruzan →       |
| E6     | A C       | L M     | ◄    | A regresa ←        |
| E*     | —         | A L C M | ►    | A+C cruzan → ¡meta!|

*** Dibujo del camino (solo flechas hacia adelante)

#+begin_example
E0 ──A+C──► E1 ──A──► E2 ──A+L──► E3 ──A+C──► E4 ──A+M──► E5 ──A──► E6 ──A+C──► E*
 ◄          ►         ◄          ►          ◄          ►         ◄          ►
#+end_example

*** ¿Por qué no hay más estados en el camino bueno?
Porque en cada paso solo hay *pocas* opciones legales; muchas combinaciones se descartan al instante (coyote con cabra, etc.). El espacio *total* válido es pequeño (unas 16 fotografías); no hace falta dibujarlas todas si A* te guía.

