index.html
<div id="outline-container-org5245d78" class="outline-4">
<h4 id="org5245d78">¿Por qué no expandir el árbol completo?</h4>
<div class="outline-text-4" id="text-org5245d78">
<p>
Un árbol de “quién se elimina en cada ronda” tiene ramificación variable y profundidad <code>n-1</code>; para <code>n</code> grande es innecesario.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Enfoque</th>
<th scope="col" class="org-left">Complejidad</th>
<th scope="col" class="org-left">Cuándo usarlo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Simulación en lista</td>
<td class="org-left">O(n²)</td>
<td class="org-left">Cualquier <code>k</code>, <code>n</code> moderado</td>
</tr>

<tr>
<td class="org-left">Recurrencia</td>
<td class="org-left">O(n)</td>
<td class="org-left">Programación dinámica</td>
</tr>

<tr>
<td class="org-left">Fórmula cerrada k=2</td>
<td class="org-left">O(log n)</td>
<td class="org-left">“Cada segundo” (clásico)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9ae4cae" class="outline-4">
<h4 id="org9ae4cae">Caso k = 2 (eliminar cada segundo)</h4>
<div class="outline-text-4" id="text-org9ae4cae">
</div>
<ul class="org-ul">
<li><a id="orgda3f56d"></a>Fórmula cerrada<br />
<div class="outline-text-5" id="text-orgda3f56d">
<p>
Sea <code>m = ⌊log₂ n⌋</code> y <code>2^m ≤ n &lt; 2^(m+1)</code>:
</p>

<p>
\[ J(n, 2) = 2 \cdot (n - 2^m) + 1 \]
</p>
</div>
</li>
<li><a id="org62101d1"></a>Intuición<br />
<div class="outline-text-5" id="text-org62101d1">
<p>
Cada ronda con <code>k=2</code> elimina la mitad (aprox.) de los vivos; la posición sobreviviente se obtiene “reflejando” el índice respecto a la mayor potencia de 2 ≤ <code>n</code>.
</p>
</div>
</li>
<li><a id="org0df7fa2"></a>Historia: n = 41 soldados<br />
<div class="outline-text-5" id="text-org0df7fa2">
<ul class="org-ul">
<li><code>2^5 = 32 ≤ 41 &lt; 64</code> → <code>m = 5</code>.</li>
<li><code>J(41, 2) = 2·(41 - 32) + 1 = 19</code>.</li>
</ul>

<p>
<b>Josefo debía situarse en la posición 19</b> (contando desde 1) si el sorteo eliminaba cada segundo.
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org5c7f275" class="outline-4">
<h4 id="org5c7f275">Ejemplo manual: n = 7, k = 2</h4>
<div class="outline-text-4" id="text-org5c7f275">
<p>
Con la convención estándar (<code>J(1,2)=1</code>, <code>J(2n)=2J(n)-1</code>, <code>J(2n+1)=2J(n)+1</code>):
</p>

<pre class="example" id="org176a9e9">
J(1)=1, J(2)=1, J(3)=3, J(4)=1, J(5)=3, J(6)=5, J(7)=7
</pre>

<p>
Fórmula potencias de 2: <code>2·(7-4)+1 = 7</code>. La posición segura es la <b>7</b> (contando desde 1).
</p>
</div>
</div>
<div id="outline-container-org7d938cb" class="outline-4">
<h4 id="org7d938cb">Caso general k (algoritmo iterativo O(n))</h4>
<div class="outline-text-4" id="text-org7d938cb">
<pre class="example" id="orgf2c2108">
J ← 0
para i = 1 … n:
    J ← (J + k) mod i
respuesta (1-indexada) = J + 1
</pre>

<p>
Este algoritmo evita simular el círculo completo (<code>O(n²)</code>) y coincide con la fórmula cerrada cuando <code>k=2</code>.
</p>
</div>
</div>
<div id="outline-container-org39314a1" class="outline-4">
<h4 id="org39314a1">Síntesis: lógica vs explosión combinatoria</h4>
<div class="outline-text-4" id="text-org39314a1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Problema</th>
<th scope="col" class="org-left">Truco principal</th>
<th scope="col" class="org-left">Viajes / respuesta</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Maridos celosos</td>
<td class="org-left">Predicado <code>segura(orilla)</code> poda BFS</td>
<td class="org-left"><b>9</b> viajes mínimos</td>
</tr>

<tr>
<td class="org-left">Puente</td>
<td class="org-left">C+D juntos una vez; poda <code>t&gt;17</code></td>
<td class="org-left"><b>17</b> minutos</td>
</tr>

<tr>
<td class="org-left">Josefo (k=2)</td>
<td class="org-left">Fórmula con potencias de 2; O(n) rec.</td>
<td class="org-left">=J(41,2)=*19*</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5a6b81f" class="outline-4">
<h4 id="org5a6b81f">Preguntas de repaso</h4>
<div class="outline-text-4" id="text-org5a6b81f">
<ol class="org-ol">
<li>¿Qué estado del problema de maridos celosos es inválido aunque el bote tenga capacidad 2?</li>
<li>¿Por qué mandar <code>A</code> dos veces de vuelta no mejora necesariamente el puente frente a devolver <code>B</code> una vez?</li>
<li>¿Cuál es <code>J(12, 2)</code>? (<code>2·(12-8)+1 = 9</code>)</li>
<li>¿En qué caso conviene simular Josefo en lugar de usar recurrencia?</li>
</ol>

<p>
<b>Referencias</b>
</p>
<ul class="org-ul">
<li>Russell &amp; Norvig, cap. 3 (búsqueda en espacios de estados).</li>
<li>Klein, T. (puzzle del puente y linterna) — optimización clásica.</li>
<li>Josephus Flavius, <b>La guerra de los judíos</b> (fuente histórica).</li>
</ul>

<pre class="example">
None
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga08467f" class="outline-2">
<h2 id="orga08467f">A*  — Arriero, coyote, cabra y maíz</h2>
<div class="outline-text-2" id="text-orga08467f">
</div>
<div id="outline-container-org397c25b" class="outline-3">
<h3 id="org397c25b">Símbolos</h3>
<div class="outline-text-3" id="text-org397c25b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Símbolo</th>
<th scope="col" class="org-left">Personaje</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">Arriero</td>
</tr>

<tr>
<td class="org-left">L</td>
<td class="org-left">Coyote (lobo)</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">Cabra (chivo, pollo)</td>
</tr>

<tr>
<td class="org-left">M</td>
<td class="org-left">Maíz</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org47b424e" class="outline-3">
<h3 id="org47b424e">Reglas del bote</h3>
<div class="outline-text-3" id="text-org47b424e">
<ul class="org-ul">
<li>Viajan el arriero y <b>como máximo uno</b> más.</li>
<li>Sin arriero, <b>nunca</b> pueden quedar solos en una orilla:
<ul class="org-ul">
<li>Coyote + cabra</li>
<li>Cabra + maíz</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org277ad02" class="outline-3">
<h3 id="org277ad02">Objetivo</h3>
<div class="outline-text-3" id="text-org277ad02">
<p>
Que los cuatro terminen en la <b>orilla derecha</b>.
</p>
</div>
</div>
<div id="outline-container-org7575966" class="outline-3">
<h3 id="org7575966">Parte 1 — ¿Qué es un estado? (la “fotografía” del río)</h3>
<div class="outline-text-3" id="text-org7575966">
<p>
En cada momento anotas <b>tres cosas</b>:
</p>

<pre class="example" id="org32f06af">
[ Quién está a la IZQUIERDA | Quién está a la DERECHA ]   BOTE

Ejemplo inicio:
  [ A L C M | — ]   Bote en izquierda ◄

Ejemplo meta:
  [ — | A L C M ]   Bote en derecha ►
</pre>

<p>
Cada vez que el bote cruza, cambias de fotografía → eso es moverte en el <b>espacio de estados</b>.
</p>
</div>
</div>
<div id="outline-container-org6ff8c73" class="outline-3">
<h3 id="org6ff8c73">Parte 2 — El espacio de estados (el mapa completo del camino bueno)</h3>
<div class="outline-text-3" id="text-org6ff8c73">
</div>
<div id="outline-container-orgf4b2533" class="outline-4">
<h4 id="orgf4b2533">Los 8 estados del camino más corto (7 cruces)</h4>
<div class="outline-text-4" id="text-orgf4b2533">
<p>
Usamos códigos E0, E1, … E* para no repetir dibujos.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Código</th>
<th scope="col" class="org-left">Izquierda</th>
<th scope="col" class="org-left">Derecha</th>
<th scope="col" class="org-left">Bote</th>
<th scope="col" class="org-left">Qué acaba de pasar</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">E0</td>
<td class="org-left">A L C M</td>
<td class="org-left">—</td>
<td class="org-left">◄</td>
<td class="org-left">(inicio)</td>
</tr>

<tr>
<td class="org-left">E1</td>
<td class="org-left">L M</td>
<td class="org-left">A C</td>
<td class="org-left">►</td>
<td class="org-left">A+C cruzan →</td>
</tr>

<tr>
<td class="org-left">E2</td>
<td class="org-left">A L M</td>
<td class="org-left">C</td>
<td class="org-left">◄</td>
<td class="org-left">A regresa ←</td>
</tr>

<tr>
<td class="org-left">E3</td>
<td class="org-left">M</td>
<td class="org-left">A L C</td>
<td class="org-left">►</td>
<td class="org-left">A+L cruzan →</td>
</tr>

<tr>
<td class="org-left">E4</td>
<td class="org-left">A C M</td>
<td class="org-left">L</td>
<td class="org-left">◄</td>
<td class="org-left">A+C regresan ←</td>
</tr>

<tr>
<td class="org-left">E5</td>
<td class="org-left">C</td>
<td class="org-left">A L M</td>
<td class="org-left">►</td>
<td class="org-left">A+M cruzan →</td>
</tr>

<tr>
<td class="org-left">E6</td>
<td class="org-left">A C</td>
<td class="org-left">L M</td>
<td class="org-left">◄</td>
<td class="org-left">A regresa ←</td>
</tr>

<tr>
<td class="org-left">E*</td>
<td class="org-left">—</td>
<td class="org-left">A L C M</td>
<td class="org-left">►</td>
<td class="org-left">A+C cruzan → ¡meta!</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgfd03d95" class="outline-4">
<h4 id="orgfd03d95">Dibujo del camino (solo flechas hacia adelante)</h4>
<div class="outline-text-4" id="text-orgfd03d95">
<pre class="example" id="orgd0e0c35">
E0 ──A+C──► E1 ──A──► E2 ──A+L──► E3 ──A+C──► E4 ──A+M──► E5 ──A──► E6 ──A+C──► E*
 ◄          ►         ◄          ►          ◄          ►         ◄          ►
</pre>
</div>
</div>
<div id="outline-container-org887da31" class="outline-4">
<h4 id="org887da31">¿Por qué no hay más estados en el camino bueno?</h4>
<div class="outline-text-4" id="text-org887da31">
<p>
Porque en cada paso solo hay <b>pocas</b> opciones legales; muchas combinaciones se descartan al instante (coyote con cabra, etc.). El espacio <b>total</b> válido es pequeño (unas 16 fotografías); no hace falta dibujarlas todas si A* te guía.
</p>
</div>
</div>
