index.html
<div id="outline-container-orgb286a87" class="outline-4">
<h4 id="orgb286a87">Ramas que se cortan desde E0 (ejemplo de poda)</h4>
<div class="outline-text-4" id="text-orgb286a87">
<p>
Desde E0 el arriero está a la izquierda. Prueba mental:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Cruce intentado</th>
<th scope="col" class="org-left">¿Se puede?</th>
<th scope="col" class="org-left">Motivo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A solo</td>
<td class="org-left">NO</td>
<td class="org-left">Quedan L y C solos a la izquierda</td>
</tr>

<tr>
<td class="org-left">A + L</td>
<td class="org-left">NO</td>
<td class="org-left">Quedan C y M solos (cabra + maíz)</td>
</tr>

<tr>
<td class="org-left">A + C</td>
<td class="org-left">SÍ → E1</td>
<td class="org-left">Ambas orillas seguras</td>
</tr>

<tr>
<td class="org-left">A + M</td>
<td class="org-left">NO</td>
<td class="org-left">Quedan L y C solos (coyote + cabra)</td>
</tr>
</tbody>
</table>

<p>
<b>Sin A</b>, ya eliminaste 3 de 4 movimientos. Eso es <b>poda</b>: no pierdes tiempo en fotografías imposibles.
</p>
</div>
</div>
</div>
<div id="outline-container-org4fca604" class="outline-3">
<h3 id="org4fca604">Parte 3 — g, h y f</h3>
<div class="outline-text-3" id="text-org4fca604">
</div>
<div id="outline-container-org0015303" class="outline-4">
<h4 id="org0015303">g = “¿Cuántos cruces ya hice?”</h4>
<div class="outline-text-4" id="text-org0015303">
<ul class="org-ul">
<li>Empiezas en E0 con <b>g = 0</b>.</li>
<li>Cada cruce del bote: <b>g sube 1</b>.</li>
<li>En E3 llevas <b>g = 3</b> (tres viajes hechos).</li>
</ul>
</div>
</div>
<div id="outline-container-orgac1af8b" class="outline-4">
<h4 id="orgac1af8b">h = “¿Cuántos cruces <b>creo</b> que faltan?” (estimación)</h4>
<div class="outline-text-4" id="text-orgac1af8b">
<p>
Regla que usamos (fácil de contar a mano):
</p>

<pre class="example" id="orga483763">
Mira la orilla DERECHA.
Cuenta cuántas de estas piezas AÚN NO están ahí:
  □ Coyote (L)
  □ Cabra  (C)
  □ Maíz   (M)

Ese número es h.
</pre>

<p>
Ejemplos:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Estado</th>
<th scope="col" class="org-left">¿L a la derecha?</th>
<th scope="col" class="org-left">¿C?</th>
<th scope="col" class="org-left">¿M?</th>
<th scope="col" class="org-left">Piezas que faltan</th>
<th scope="col" class="org-right">h</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">E0</td>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-left">No</td>
<td class="org-left">L, C, M</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">E1</td>
<td class="org-left">No</td>
<td class="org-left">Sí</td>
<td class="org-left">No</td>
<td class="org-left">L, M</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">E3</td>
<td class="org-left">Sí</td>
<td class="org-left">Sí</td>
<td class="org-left">No</td>
<td class="org-left">M</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">E*</td>
<td class="org-left">Sí</td>
<td class="org-left">Sí</td>
<td class="org-left">Sí</td>
<td class="org-left">ninguna</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
<b>Truco:</b> nunca decimos “falta 0 cruces” cuando aún falta una pieza → la
estimación no miente en exceso (<b>admisible</b>).
</p>
</div>
</div>
<div id="outline-container-org3e49b27" class="outline-4">
<h4 id="org3e49b27">f = “¿Qué tan prioritario es este estado?”</h4>
<div class="outline-text-4" id="text-org3e49b27">
<pre class="example" id="orgf934b0f">
f = g + h
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Estado</th>
<th scope="col" class="org-right">g</th>
<th scope="col" class="org-right">h</th>
<th scope="col" class="org-right">f = g+h</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">E0</td>
<td class="org-right">0</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">E1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">E2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">E3</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">E4</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">E5</td>
<td class="org-right">5</td>
<td class="org-right">1</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">E6</td>
<td class="org-right">6</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">E*</td>
<td class="org-right">7</td>
<td class="org-right">0</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

<p>
A* siempre mira primero el estado <b>pendiente</b> con <b>f más bajo</b>.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd5a3a49" class="outline-3">
<h3 id="orgd5a3a49">Parte 4 — A* paso a paso (tabla de “lista de pendientes”)</h3>
<div class="outline-text-3" id="text-orgd5a3a49">
<p>
Imagina una <b>lista de tareas</b> llamada OPEN. Sacas la tarea con menor <b>f</b>,
la miras, generas hijos, y repites.
</p>
</div>
<div id="outline-container-org83752c9" class="outline-4">
<h4 id="org83752c9">Iteración 1</h4>
<div class="outline-text-4" id="text-org83752c9">
<p>
<b>Sacas:</b> E0 (f=3)
</p>

<p>
<b>Generas hijos desde E0:</b> solo E1 es legal.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Estado nuevo</th>
<th scope="col" class="org-right">g</th>
<th scope="col" class="org-right">h</th>
<th scope="col" class="org-right">f</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">E1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>
</tbody>
</table>

<p>
OPEN ahora: { E1 (f=3) }
¿Meta? No.
</p>
</div>
</div>
<div id="outline-container-org99c5ea6" class="outline-4">
<h4 id="org99c5ea6">Iteración 2</h4>
<div class="outline-text-4" id="text-org99c5ea6">
<p>
<b>Sacas:</b> E1 (f=3)
</p>

<p>
<b>Posibles regresos desde la derecha:</b>
</p>
<ul class="org-ul">
<li>A solo → E2 (legal)</li>
<li>A+C → vuelves casi al inicio (legal pero <b>g=2, h=3, f=5</b> → peor; A* lo guarda solo si no había otra forma más barata de llegar ahí)</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Estado nuevo</th>
<th scope="col" class="org-right">g</th>
<th scope="col" class="org-right">h</th>
<th scope="col" class="org-right">f</th>
<th scope="col" class="org-left">¿Lo priorizo?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">E2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">4</td>
<td class="org-left">Sí, es el mejor ahora</td>
</tr>

<tr>
<td class="org-left">(casi E0)</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">5</td>
<td class="org-left">Peor f, se queda atrás</td>
</tr>
</tbody>
</table>

<p>
OPEN: { E2 (f=4) }
</p>
</div>
</div>
<div id="outline-container-org00feb9a" class="outline-4">
<h4 id="org00feb9a">Iteración 3</h4>
<div class="outline-text-4" id="text-org00feb9a">
<p>
<b>Sacas:</b> E2 (f=4)
</p>

<p>
Desde izquierda (A, L, M presentes):
</p>
<ul class="org-ul">
<li>A solo → izq L M, der C → g=3, h=2, f=5</li>
<li>A+L → E3 → g=3, h=1, <b>f=4</b> ← empata y es más prometedor</li>
<li>A+M → ilegal (cabra sola con maíz al otro lado…)</li>
</ul>

<p>
OPEN: { E3 (f=4), otros con f=5 si existen }
</p>
</div>
</div>
<div id="outline-container-orgcb9a1d3" class="outline-4">
<h4 id="orgcb9a1d3">Iteración 4</h4>
<div class="outline-text-4" id="text-orgcb9a1d3">
<p>
<b>Sacas:</b> E3 (f=4) — en la derecha están A, L, C; falta solo M (h=1)
</p>

<p>
Regreso legal que avanza: A+C → E4 (g=4, h=2, f=6)
</p>
</div>
</div>
<div id="outline-container-org56552bb" class="outline-4">
<h4 id="org56552bb">Iteraciones 5–7 (resumen en una tabla)</h4>
<div class="outline-text-4" id="text-org56552bb">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Iter</th>
<th scope="col" class="org-left">Saco</th>
<th scope="col" class="org-left">Mejor hijo</th>
<th scope="col" class="org-left">Cruce</th>
<th scope="col" class="org-right">g</th>
<th scope="col" class="org-right">h</th>
<th scope="col" class="org-right">f</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">5</td>
<td class="org-left">E4</td>
<td class="org-left">E5</td>
<td class="org-left">A+M →</td>
<td class="org-right">5</td>
<td class="org-right">1</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">E5</td>
<td class="org-left">E6</td>
<td class="org-left">A ←</td>
<td class="org-right">6</td>
<td class="org-right">1</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">E6</td>
<td class="org-left">E*</td>
<td class="org-left">A+C →</td>
<td class="org-right">7</td>
<td class="org-right">0</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

<p>
<b>E</b> tiene h=0 → <b>¡meta!</b> Costo total <b>g = 7</b> cruces.
</p>
</div>
</div>
<div id="outline-container-orgefbe7b9" class="outline-4">
<h4 id="orgefbe7b9">¿Qué aprendiste del proceso?</h4>
<div class="outline-text-4" id="text-orgefbe7b9">
<ol class="org-ol">
<li>No probaste “todas las historias posibles” a lo loco.</li>
<li>En cada paso calculaste <b>g</b>, <b>h</b> y <b>f</b> con sumas sencillas.</li>
<li>Las reglas del coyote/cabra <b>borraron</b> ramas sin explorarlas.</li>
<li>Llegaste al mínimo (7) porque <b>h</b> nunca prometió de menos de lo necesario.</li>
</ol>
</div>
</div>
</div>
