index.html
<div id="outline-container-orga6a7315" class="outline-3">
<h3 id="orga6a7315">Parte 5 — La solución contada como cuento (7 cruces)</h3>
<div class="outline-text-3" id="text-orga6a7315">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">#</th>
<th scope="col" class="org-left">Qué hace el arriero</th>
<th scope="col" class="org-left">Estado después</th>
<th scope="col" class="org-right">g</th>
<th scope="col" class="org-right">h</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Lleva la <b>cabra</b> →</td>
<td class="org-left">E1</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Regresa solo ←</td>
<td class="org-left">E2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Lleva el <b>coyote</b> →</td>
<td class="org-left">E3</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Vuelve con la cabra ←</td>
<td class="org-left">E4</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Lleva el <b>maíz</b> →</td>
<td class="org-left">E5</td>
<td class="org-right">5</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Regresa solo ←</td>
<td class="org-left">E6</td>
<td class="org-right">6</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Lleva la <b>cabra</b> →</td>
<td class="org-left">E*</td>
<td class="org-right">7</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
<b>¿Por qué la cabra va y viene tanto?</b> Es la única pieza que “se pelea” con las otras dos. Actúa como <b>puente</b> seguro.
</p>
</div>
</div>
<div id="outline-container-org1fd15bd" class="outline-3">
<h3 id="org1fd15bd">Parte 6 — Comparación rápida</h3>
<div class="outline-text-3" id="text-org1fd15bd">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Método</th>
<th scope="col" class="org-left">¿Usa h?</th>
<th scope="col" class="org-left">¿Qué hace en este problema?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Probar a mano</td>
<td class="org-left">Sí, en la cabeza</td>
<td class="org-left">“Llevo la cabra primero”</td>
</tr>

<tr>
<td class="org-left">BFS / anchura</td>
<td class="org-left">No</td>
<td class="org-left">Explora por capas de g hasta hallar E*</td>
</tr>

<tr>
<td class="org-left">A*</td>
<td class="org-left">Sí</td>
<td class="org-left">Ordena por f=g+h; suele llegar antes a E*</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org46b0bba" class="outline-3">
<h3 id="org46b0bba">Parte 7 — Ejercicios con lápiz y papel</h3>
<div class="outline-text-3" id="text-org46b0bba">
<ol class="org-ol">
<li>En <b>E2</b> (<code>[ A L M | C ]</code>), calcula g, h y f sin mirar la tabla.</li>
<li>Desde <b>E3</b>, ¿por qué <b>A solo</b> hacia la izquierda es ilegal? (mira la orilla derecha.)</li>
<li>Dibuja en una hoja los 8 estados E0…E* y conecta con flechas.</li>
<li>En <b>E5</b>, ¿cuántas piezas faltan a la derecha? ¿Cuál es h?</li>
</ol>

<p>
<b>Respuestas breves:</b>
</p>
<ul class="org-ul">
<li>E2: g=2, faltan L y M en derecha → h=2, f=4.</li>
<li>A solo desde E3 dejaría L y C en la derecha sin arriero → coyote + cabra.</li>
<li>E5: solo falta C en la derecha → h=1.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org42505cd" class="outline-2">
<h2 id="org42505cd">Actividades</h2>
<div class="outline-text-2" id="text-org42505cd">
</div>
<div id="outline-container-org494999e" class="outline-3">
<h3 id="org494999e">Operación Dino Crash (EDA conceptual)</h3>
<div class="outline-text-3" id="text-org494999e">
</div>
<div id="outline-container-org5efc777" class="outline-4">
<h4 id="org5efc777">Introducción a la Misión</h4>
<div class="outline-text-4" id="text-org5efc777">
<p>
Agentes, el cuartel general <b>quiere que
piensen como *analistas de datos</b>: qué dataset haría falta, qué
preguntas hacerle a los datos y, <b>solo después de entenderlos</b>, qué tipo
de modelo de IA tendría sentido.
</p>

<p>
<b>Contexto:</b> el juego del dinosaurio de Chrome (<b>Dino Run</b>) — el que aparece sin internet.
</p>

<p>
<b>Reglas de esta operación:</b>
</p>
<ul class="org-ul">
<li><b>No se entrega código.</b> Solo análisis escrito (reporte en Markdown).</li>
<li>Justifica cada respuesta con razonamiento sobre <b>forma de los datos</b>, no con intuición vaga.</li>
<li>Usa tablas, listas y mini-ejemplos numéricos cuando ayuden.</li>
</ul>

<p>
<b>Entregable único:</b> <code>reporte_dino_crash_eda.md</code>
</p>
</div>
</div>
<div id="outline-container-org4485cca" class="outline-4">
<h4 id="org4485cca">¿Qué es EDA y por qué va <b>antes</b> del modelo?</h4>
<div class="outline-text-4" id="text-org4485cca">
<pre class="example" id="org63f5e0f">
Datos crudos  →  EDA (entender)  →  Decisión de modelo  →  (luego) entrenar

Si eliges el modelo primero, corres el riesgo de usar un martillo
para un tornillo: datos desbalanceados, variables mal definidas,
o un problema que no era clasificación sino regresión.
</pre>
</div>
</div>
<div id="outline-container-orgbdd2d80" class="outline-4">
<h4 id="orgbdd2d80">Bloque 1 — ¿Qué dataset necesitamos?</h4>
<div class="outline-text-4" id="text-orgbdd2d80">
</div>
<ul class="org-ul">
<li><a id="org9351cdf"></a>Misión 1: Definir el problema y el dataset ideal<br />
<ul class="org-ul">
<li><a id="org58c3ee3"></a>La Historia<br />
<div class="outline-text-6" id="text-org58c3ee3">
<p>
Antes de “predecir algo”, hay que decidir <b>qué pregunta</b> respondes y <b>qué fila</b> representa cada observación.
</p>
</div>
</li>
<li><a id="org30d8782"></a>Escenarios posibles (elige analizar los tres en el reporte)<br />
<div class="outline-text-6" id="text-org30d8782">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ID</th>
<th scope="col" class="org-left">Pregunta de negocio / juego</th>
<th scope="col" class="org-left">¿Una fila = qué?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">P1</td>
<td class="org-left">¿Morirá en el <b>siguiente</b> frame?</td>
<td class="org-left">Un frame de una partida</td>
</tr>

<tr>
<td class="org-left">P2</td>
<td class="org-left">¿Cuántos puntos alcanzará <b>esta</b> partida al morir?</td>
<td class="org-left">Una partida completa</td>
</tr>

<tr>
<td class="org-left">P3</td>
<td class="org-left">¿Qué tipo de obstáculo viene <b>próximo</b>?</td>
<td class="org-left">Un frame o un evento</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org1b216c5"></a>Tu Tarea (escrito)<br />
<div class="outline-text-6" id="text-org1b216c5">
<p>
Para <b>cada</b> escenario P1, P2 y P3:
</p>

<ol class="org-ol">
<li><b>Variable objetivo (Y):</b> ¿qué columna sería? ¿tipo? (numérica, categórica, binaria).</li>
<li><b>Variables de entrada (X):</b> lista <b>mínimo 5</b> columnas que pedirías y por qué cada una.</li>
<li><b>Granularidad:</b> ¿necesitas un frame cada 16 ms, cada salto, o un resumen por partida?</li>
<li><b>Tamaño mínimo razonable:</b> ¿cuántas filas o partidas harían falta para confiar? Argumenta.</li>
<li><b>Riesgo si el dataset está mal definido:</b> un error de diseño y su consecuencia.</li>
</ol>
</div>
</li>
</ul>
</li>
<li><a id="orgf9f4ec1"></a>Misión 2: Diccionario de datos (qué debe traer el CSV)<br />
<ul class="org-ul">
<li><a id="org4202cf6"></a>La Historia<br />
<div class="outline-text-6" id="text-org4202cf6">
<p>
Interceptaste un borrador de telemetría. Revisa si alcanza para P1 o si le falta algo.
</p>
</div>
</li>
<li><a id="orgdfb4f03"></a>Columnas propuestas<br />
<div class="outline-text-6" id="text-orgdfb4f03">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Columna</th>
<th scope="col" class="org-left">Tipo sugerido</th>
<th scope="col" class="org-left">Descripción breve</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>session_id</code></td>
<td class="org-left">entero</td>
<td class="org-left">ID de partida</td>
</tr>

<tr>
<td class="org-left"><code>frame</code></td>
<td class="org-left">entero</td>
<td class="org-left">Índice del frame en la partida</td>
</tr>

<tr>
<td class="org-left"><code>time_ms</code></td>
<td class="org-left">entero</td>
<td class="org-left">Tiempo desde que empezó la partida</td>
</tr>

<tr>
<td class="org-left"><code>score</code></td>
<td class="org-left">entero</td>
<td class="org-left">Puntuación en pantalla</td>
</tr>

<tr>
<td class="org-left"><code>speed</code></td>
<td class="org-left">numérico</td>
<td class="org-left">Velocidad del escenario</td>
</tr>

<tr>
<td class="org-left"><code>obstacle_type</code></td>
<td class="org-left">categórica</td>
<td class="org-left"><code>none</code>, <code>cactus_small</code>, <code>cactus_large</code>, <code>bird</code></td>
</tr>

<tr>
<td class="org-left"><code>dist_obstacle</code></td>
<td class="org-left">numérico</td>
<td class="org-left">Distancia al próximo obstáculo (px)</td>
</tr>

<tr>
<td class="org-left"><code>jump</code></td>
<td class="org-left">binaria 0/1</td>
<td class="org-left">¿El dino está saltando?</td>
</tr>

<tr>
<td class="org-left"><code>died</code></td>
<td class="org-left">binaria 0/1</td>
<td class="org-left">1 solo en el último frame de la sesión</td>
</tr>
</tbody>
</table>
</div>
</li>
