index.html
<li><a id="org21747dc"></a>Muestra para analizar (10 filas — sesión 7)<br />
<div class="outline-text-6" id="text-org21747dc">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">frame</th>
<th scope="col" class="org-right">time<sub>ms</sub></th>
<th scope="col" class="org-right">score</th>
<th scope="col" class="org-right">speed</th>
<th scope="col" class="org-left">obstacle<sub>type</sub></th>
<th scope="col" class="org-right">dist<sub>obstacle</sub></th>
<th scope="col" class="org-right">jump</th>
<th scope="col" class="org-right">died</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">6.0</td>
<td class="org-left">none</td>
<td class="org-right">180</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">40</td>
<td class="org-right">640</td>
<td class="org-right">8</td>
<td class="org-right">6.4</td>
<td class="org-left">none</td>
<td class="org-right">165</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">80</td>
<td class="org-right">1280</td>
<td class="org-right">16</td>
<td class="org-right">6.8</td>
<td class="org-left">cactus<sub>small</sub></td>
<td class="org-right">55</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">81</td>
<td class="org-right">1296</td>
<td class="org-right">16</td>
<td class="org-right">6.8</td>
<td class="org-left">cactus<sub>small</sub></td>
<td class="org-right">38</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">82</td>
<td class="org-right">1312</td>
<td class="org-right">16</td>
<td class="org-right">6.8</td>
<td class="org-left">cactus<sub>small</sub></td>
<td class="org-right">12</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">6.0</td>
<td class="org-left">none</td>
<td class="org-right">200</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">120</td>
<td class="org-right">1920</td>
<td class="org-right">24</td>
<td class="org-right">7.2</td>
<td class="org-left">bird</td>
<td class="org-right">48</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">200</td>
<td class="org-right">3200</td>
<td class="org-right">40</td>
<td class="org-right">8.0</td>
<td class="org-left">none</td>
<td class="org-right">150</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">280</td>
<td class="org-right">4480</td>
<td class="org-right">56</td>
<td class="org-right">8.8</td>
<td class="org-left">cactus<sub>large</sub></td>
<td class="org-right">22</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">50</td>
<td class="org-right">800</td>
<td class="org-right">10</td>
<td class="org-right">6.5</td>
<td class="org-left">cactus<sub>small</sub></td>
<td class="org-right">90</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
<b>(Filas 1–5: misma sesión que termina en frame 82; filas 6–9: otras sesiones resumidas.)</b>
</p>
</div>
</li>
<li><a id="org521a68b"></a>Tu Tarea (escrito)<br />
<div class="outline-text-6" id="text-org521a68b">
<ol class="org-ol">
<li>¿Qué <b>patrón</b> ves en la fila donde <code>died=1</code> (frame 82)?</li>
<li>¿=score= es buena variable para predecir muerte <b>en el siguiente frame</b>? ¿Por qué sí o no?</li>
<li>¿Falta alguna columna crítica para P1? (pista: altura del dino, agachado, lag de reacción del jugador…)</li>
<li>¿=died= tal como está definida sirve para P1 o solo describe el <b>final</b> de la partida?</li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgf23db4b" class="outline-4">
<h4 id="orgf23db4b">Bloque 2 — Preguntas que todo EDA debe responder</h4>
<div class="outline-text-4" id="text-orgf23db4b">
</div>
<ul class="org-ul">
<li><a id="org65dfe5a"></a>Misión 3: Las diez preguntas del analista<br />
<ul class="org-ul">
<li><a id="org4069922"></a>La Historia<br />
<div class="outline-text-6" id="text-org4069922">
<p>
Un dataset “bonito en papel” puede esconder trampas. El EDA responde esto <b>antes</b> de elegir modelo.
</p>
</div>
</li>
<li><a id="org364203a"></a>Checklist EDA (completa en el reporte para el juego del dino)<br />
<div class="outline-text-6" id="text-org364203a">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">#</th>
<th scope="col" class="org-left">Pregunta EDA</th>
<th scope="col" class="org-left">¿Qué buscas?</th>
<th scope="col" class="org-left">Si la respuesta es mala, ¿qué modelo evitas o qué haces?</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">¿Cuántas observaciones hay?</td>
<td class="org-left">Tamaño N, partidas</td>
<td class="org-left">Modelos complejos con pocos datos</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">¿Hay valores faltantes?</td>
<td class="org-left">% NA por columna</td>
<td class="org-left">Algunos modelos no toleran NA; imputar o descartar</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">¿La clase objetivo está balanceada? (P1)</td>
<td class="org-left">% muerte vs no-muerte por frame</td>
<td class="org-left">Métrica accuracy engañosa; considerar F1, ponderar clases</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">¿Hay fugas de información (<b>leakage</b>)?</td>
<td class="org-left">¿Y incluye el futuro?</td>
<td class="org-left">Cualquier modelo “perfecto” en validación falsa</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">¿Variables correlacionadas?</td>
<td class="org-left">score vs time<sub>ms</sub></td>
<td class="org-left">Regresión inestable; redundancia</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">¿Distribución de <code>speed</code>?</td>
<td class="org-left">¿sube siempre? ¿tope?</td>
<td class="org-left">Modelos que asumen linealidad infinita</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">¿Outliers?</td>
<td class="org-left">dist<sub>obstacle</sub> negativo, saltos imposibles</td>
<td class="org-left">Limpiar antes de entrenar</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">¿Datos i.i.d.?</td>
<td class="org-left">¿frames de la misma sesión son independientes?</td>
<td class="org-left">Train/test por <b>sesión</b>, no por fila suelta</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">¿Estacionariedad?</td>
<td class="org-left">¿misma distribución al inicio y al final?</td>
<td class="org-left">Modelo global puede fallar en partidas largas</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">¿Sesgo de muestreo?</td>
<td class="org-left">¿solo expertos? ¿solo móvil?</td>
<td class="org-left">Generalización dudosa</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org8f5cd9b"></a>Tu Tarea<br />
<div class="outline-text-6" id="text-org8f5cd9b">
<ol class="org-ol">
<li>Elige <b>tres</b> preguntas del checklist y respóndelas <b>como si</b> tuvieras el dataset completo del dino (hipótesis razonables).</li>
<li>Para la pregunta 8 (<b>i.i.d.</b>): explica por qué mezclar frames de la misma partida en entrenamiento y prueba es un error.</li>
<li>Da un ejemplo concreto de <b>data leakage</b> usando <code>score</code> o <code>time_ms</code> en P1.</li>
</ol>
</div>
</li>
</ul>
</li>
<li><a id="org46c8690"></a>Misión 4: Leer distribuciones sin gráfica (interpretación)<br />
<ul class="org-ul">
<li><a id="orgf9bd3a5"></a>La Historia<br />
<div class="outline-text-6" id="text-orgf9bd3a5">
<p>
Te pasan <b>resúmenes</b> estadísticos en lugar de código. Debes sacar conclusiones.
</p>
</div>
</li>
<li><a id="orga8fd9da"></a>Resumen hipotético (50 partidas, ~12 000 frames)<br />
<div class="outline-text-6" id="text-orga8fd9da">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-right">Media</th>
<th scope="col" class="org-right">Mediana</th>
<th scope="col" class="org-right">Mín</th>
<th scope="col" class="org-right">Máx</th>
<th scope="col" class="org-left">Comentario del analista previo</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>score</code> (por frame)</td>
<td class="org-right">28</td>
<td class="org-right">18</td>
<td class="org-right">0</td>
<td class="org-right">120</td>
<td class="org-left">Cola larga hacia la derecha</td>
</tr>

<tr>
<td class="org-left"><code>speed</code></td>
<td class="org-right">8.5</td>
<td class="org-right">8.2</td>
<td class="org-right">6.0</td>
<td class="org-right">13.0</td>
<td class="org-left">Sube con el tiempo de partida</td>
</tr>

<tr>
<td class="org-left"><code>dist_obstacle</code></td>
<td class="org-right">95</td>
<td class="org-right">88</td>
<td class="org-right">5</td>
<td class="org-right">220</td>
<td class="org-left">Muertes suelen con dist &lt; 20</td>
</tr>

<tr>
<td class="org-left"><code>died</code> (por frame)</td>
<td class="org-right">—</td>
<td class="org-right">—</td>
<td class="org-right">—</td>
<td class="org-right">—</td>
<td class="org-left">Solo 50 unos en todo el dataset</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org6b8947f"></a>Conteos de <code>obstacle_type</code> (todos los frames)<br />
<div class="outline-text-6" id="text-org6b8947f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Tipo</th>
<th scope="col" class="org-right">% aprox.</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">none</td>
<td class="org-right">54%</td>
</tr>

<tr>
<td class="org-left">cactus<sub>small</sub></td>
<td class="org-right">20%</td>
</tr>

<tr>
<td class="org-left">cactus<sub>large</sub></td>
<td class="org-right">15%</td>
</tr>

<tr>
<td class="org-left">bird</td>
<td class="org-right">11%</td>
</tr>
</tbody>
</table>
</div>
</li>
