index.html
<li><a id="org1d8c065"></a>Tu Tarea (escrito)<br />
<div class="outline-text-6" id="text-org1d8c065">
<ol class="org-ol">
<li>¿El problema P1 (muerte en siguiente frame) está <b>desbalanceado</b>? Cuantifica con los números dados.</li>
<li>¿Qué implica eso para la <b>métrica</b> que usarías? (accuracy vs precision/recall/F1).</li>
<li>¿=dist<sub>obstacle</sub>= parece útil como predictor? Argumenta con la fila de muertes.</li>
<li>¿La distribución de <code>score</code> sugiere regresión simple o necesitas transformación / otro enfoque?</li>
</ol>
</div>
</li>
</ul>
</li>
</ul>
</div>
<div id="outline-container-orgdc012ab" class="outline-4">
<h4 id="orgdc012ab">Bloque 3 — Del EDA a la elección del modelo</h4>
<div class="outline-text-4" id="text-orgdc012ab">
</div>
<ul class="org-ul">
<li><a id="orge20fa13"></a>Misión 5: Árbol de decisión “dataset → modelo”<br />
<ul class="org-ul">
<li><a id="org4f7e215"></a>La Historia<br />
<div class="outline-text-6" id="text-org4f7e215">
<p>
El mando quiere una <b>guía</b> para no elegir modelos de moda sin datos que los soporten.
</p>
</div>
</li>
<li><a id="org09eced3"></a>Tabla guía (completa y comenta en el reporte)<br />
<div class="outline-text-6" id="text-org09eced3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Si tu EDA encuentra…</th>
<th scope="col" class="org-left">Tipo de problema</th>
<th scope="col" class="org-left">Modelos razonables</th>
<th scope="col" class="org-left">Modelos poco razonables (y por qué)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Y binaria, tabular, N mediano</td>
<td class="org-left">Clasificación</td>
<td class="org-left">Regresión logística, árbol, Random Forest</td>
<td class="org-left">Red profunda sin más datos (overfitting)</td>
</tr>

<tr>
<td class="org-left">Y binaria <b>muy</b> desbalanceada</td>
<td class="org-left">Clasificación</td>
<td class="org-left">Mismo + class<sub>weight</sub>, umbral, SMOTE (con cuidado)</td>
<td class="org-left">Accuracy como única métrica</td>
</tr>

<tr>
<td class="org-left">Y numérica (score final)</td>
<td class="org-left">Regresión</td>
<td class="org-left">Regresión lineal, árbol regresor</td>
<td class="org-left">Clasificador binario</td>
</tr>

<tr>
<td class="org-left">Y categórica multiclase (tipo obstáculo)</td>
<td class="org-left">Clasificación multiclase</td>
<td class="org-left">Logística multinomial, árbol</td>
<td class="org-left">Regresión lineal sobre códigos 1,2,3</td>
</tr>

<tr>
<td class="org-left">Secuencia de frames por sesión</td>
<td class="org-left">Serie / secuencia</td>
<td class="org-left">Features + clasificador; LSTM/GRU <b>si</b> hay muchas sesiones</td>
<td class="org-left">Ignorar orden temporal</td>
</tr>

<tr>
<td class="org-left">Relación clara y lineal pocas variables</td>
<td class="org-left">Interpretable</td>
<td class="org-left">Regresión logística / lineal</td>
<td class="org-left">Ensemble opaco sin necesidad</td>
</tr>

<tr>
<td class="org-left">Muchas variables categóricas</td>
<td class="org-left">Tabular</td>
<td class="org-left">Árboles, encoding ordinal/one-hot</td>
<td class="org-left">Distancia euclidiana cruda en texto</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="orgd6817e0"></a>Tu Tarea (escrito)<br />
<div class="outline-text-6" id="text-orgd6817e0">
<p>
Para cada escenario del inicio:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Escenario</th>
<th scope="col" class="org-left">Tras tu EDA, ¿qué fila de la guía aplica?</th>
<th scope="col" class="org-left">Modelo que propondrías</th>
<th scope="col" class="org-left">2 condiciones del dataset que <b>deben</b> cumplirse</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">P1</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">P3</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
</ul>
</li>
<li><a id="orgb678c48"></a>Misión 6: Contraejemplo — cuándo <b>no</b> usar un modelo<br />
<ul class="org-ul">
<li><a id="org0efddd6"></a>La Historia<br />
<div class="outline-text-6" id="text-org0efddd6">
<p>
A veces el EDA dice: <b>aún no hay datos suficientes</b> o <b>la pregunta está mal planteada</b>.
</p>
</div>
</li>
<li><a id="orgd2e8fec"></a>Tu Tarea (escrito)<br />
<div class="outline-text-6" id="text-orgd2e8fec">
<ol class="org-ol">
<li>Describe un escenario del dino donde un <b>árbol profundo</b> parecería buena idea pero el EDA lo desaconsejaría.</li>
<li>Describe un escenario donde una <b>red neuronal</b> tendría sentido y qué deberías ver en el EDA para justificarla.</li>
<li>¿Se podría resolver P1 con <b>reglas fijas</b> (<code>si dist_obstacle &lt; X y jump=0 entonces muerte</code>)? Compara con un modelo aprendido: ventajas y límites.</li>
</ol>
</div>
</li>
</ul>
</li>
<li><a id="org0aa19d0"></a>Bloque 4 — Cierre<br />
<ul class="org-ul">
<li><a id="orgcbbc5ae"></a>Misión 7: Informe del analista (entregable final)<br />
<ul class="org-ul">
<li><a id="org39086cf"></a>Plantilla <code>reporte_dino_crash_eda.md</code><br />
<div class="outline-text-7" id="text-org39086cf">
<pre class="example" id="org645e3a4">
# Reporte EDA — Operación Dino Crash
**Analista:** [Nombre / Matrícula]

## 1. Problema y dataset (Misión 1)
### P1 — Muerte en el siguiente frame
- Y:
- X (mínimo 5 variables):
- Granularidad:
- Tamaño mínimo de dataset:

(repite P2, P3)

## 2. Diccionario y muestra (Misión 2)
- Patrón en died=1:
- ¿Falta alguna columna?

## 3. Checklist EDA (Misión 3)
(respuestas a 3 preguntas + leakage + i.i.d.)

## 4. Interpretación de resúmenes (Misión 4)
(desbalance, métricas, dist_obstacle)

## 5. Elección de modelo (Misiones 5–6)
(tabla P1/P2/P3 + contraejemplos)

## Síntesis (5 líneas)
¿Qué dataset pedirías primero y qué modelo *solo después* del EDA?
</pre>
</div>
</li>
</ul>
</li>
<li><a id="org22f0389"></a>Rúbrica sugerida (docente)<br />
<div class="outline-text-6" id="text-org22f0389">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Criterio</th>
<th scope="col" class="org-right">Puntos</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Definición clara de Y y granularidad por escenario</td>
<td class="org-right">25%</td>
</tr>

<tr>
<td class="org-left">Preguntas EDA pertinentes (balance, leakage, i.i.d.)</td>
<td class="org-right">25%</td>
</tr>

<tr>
<td class="org-left">Elección de modelo ligada a hallazgos del EDA</td>
<td class="org-right">30%</td>
</tr>

<tr>
<td class="org-left">Claridad y coherencia del reporte</td>
<td class="org-right">20%</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="org118126d"></a>Sin programación en esta operación<br />
<div class="outline-text-6" id="text-org118126d">
<p>
El objetivo es que el alumno entienda: <b>el modelo no se elige por fama; se elige porque el dataset, visto con EDA, tiene cierta forma.</b>
</p>

<pre class="example">
None
</pre>
</div>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Eduardo Alcaraz</p>
<p class="date">Created: 2026-07-08 mié 11:25</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
